{"intents":
    [
      {
        "tag":"greetings",
        "input":["hello","hi there","hi","hey there","hey","hi there","hi, nice to meet you","hello there","anyone there?","knock knock","Hey","Hola", "Hello", "Good day", "Hey", "Habari", "Niaje"],
        "responses":[
            "Hi. I am Kemba, an assistive chatbot, how may I help?",
            "Hello I'm Kemba, your chatbot assistant, Need help?",
            "Welcome to AssistiveChat, I'm Kemba, how may I help you?",
            "Hi, Kemba here, How may I be of service?",
            "Hello friend, How can I help you?",
            "Hey, glad you texted. How are you?",
            "Hi stranger",
            "Hello stranger"
          ]
      },
      {
        "tag":"goodbye",
        "input":["Bye","bye kemba","adios","okay bye","goodbye","see you later","i will catch you later","i will catch up later","okay i will see you later","I will talk to you later","will text you later","bye bro, I'll talk to you later","Bye friend", "See you", "Kwaheri", "Talk Later", "We'll talk soon"],
        "responses":[
            "Your Welcome, Bye!",
            "Have a lovely day",
            "Goodbye!",
            "See you later",
            "Interesting conversation. Bye!",
            "Okay. Have a nice day",
            "Take Care",
            "we'll talk soon",
            "Yeah Sure, We'll talk later",
            "Okay , Take care"
          ]
      },
      {
        "tag":"howami",
        "input":["how are you?","I am fine, how are you?", "I'm fine, you?","are you well?","how are things going?","everything okay?","What's up with you?","Doing okay?","is everything okay?"],
        "responses":[
            "Yeah, I am fine",
            "Everything's going quite well, thanks for asking",
            "Doing pretty well. Thanks for asking",
            "Things are Great",
            "Nothing much going on around here",
            "I am Great!",
            "Everything's great.",
            "I am doing good, though life is pretty boring. I need to go on an adventure"
          ]
      },
      {
        "tag":"whoareyou",
      "input":["who are you?","what are you?","what is your name?","are you a chatbot?","what can I call you?","your name?","are you a bot?","how do I address you?","How do I call you?", "Whats your name", "Tell me your name", "Tell me about yourself", "You are?", "What are you supposed to be"],
        "responses":[
            "I am Kemba, your chatbot personal assistant for the AssistiveChat platform. The AssistiveChat platform is an assistive chatbot with important information for the disabled in Kenya including tips and opportunities.",
            "I am Kemba and you could ask me questions about any form of physical disabilities and I shall try give you the best assistive information possible.",
            "Kemba at your service",
            "My name is Kemba and yes, I am the G.O.A.T then Messi.",
            "You can call me Kemba and I am here to share tips & interesting opportunities for the disabled in Kenya.",
            "My name is Kemba and I am here to answer your questions regarding physical disabilities or impairments. Go ahead, ask away."
          ]
      },
      {
        "tag":"whereareyou",
      "input":["where are you from?","which country are you from?","where do you live?","where are you ?","where do you live in?","which place do you live in?","where are you currently based?","where do you live currently?","you are from where?","you are from?"],
        "responses":[
            "That's a tough quesion. Let's just say, I live in the interwebs",
            "I am here, there, everywhere across the vast internet.",
            "I live in the internet. I just spend time researching so that I may help you better.",
            "I am right here, what's up?"
          ]
      },

      {"tag": "thanks",
        "input": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me", "Asante", "Asante sana", "Shukran", "I appreciate your help", "much appreciated", "Thank you very much"],
        "responses": ["Happy to help!", "Any time!", "My pleasure", "You are welcome", "Sure dude", "Karibu", "Karibu ndugu", "Just doing my job", ""]
      },

      {"tag": "noanswer",
        "input": [],
        "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "I am still here dude", "Huh!?", "Didn't quite catch you there! Try Again.", "I dont understand, I'm afraid", "Beg your pardon?"]
      },
 
      {"tag": "help",
        "input": ["What do you do", "How can you help", "What do you know", "What is your purpose", "How can you help", "Why are you here", "What are your intentions", "I am looking for help", "I need help", "Can you help", "help, please", "I need help please", "What do you do", ""],
        "responses": ["I can tell you about disabilities, how to live support the disabled and even useful opportunities for education & social groups that support disabled persons in Kenya.", "I can give you interesting tips for supporting disabled persons. I also have useful information on special needs schools in Kenya as well as other opportunities meaningful to disabled persons."]
       },

      {
        "tag":"about_app",
      "input":["What is AssistiveChat?", "What is Assistive Chat?", "What is this application about?", "What is this app about?", "about Assistive Chat", "what is Assistive Chat about?", "what is AssistiveChat about?", "describe what Assistive Chat is.", "describe what AssistiveChat is."],
        "responses":[
            "AssistiveChat is a chatbot application that acts as an assistive medium of communication and information-sharing for disabled persons & thier guardians or partners",
            "AssistiveChat is a chatbot application for persons with disabilities, their partners and guardians that provides useful information & opportunities related to the disabled population in Kenya.",
            "AssistiveChat is an interactive chatbot app that provides helpful information to the physically impaired, their guardians and partners. It aims to be a one stop source for assstive information for the disabled in Kenya",
            "AssistiveChat is a one-stop platform for and interactive chat experience with Kemba, our assistive chatbot filled with vast knowledge of useful information for improving the lives of disabled persons & their partners in Kenya?"
          ]
      },

      {
      "tag":"disability_define",
      "input":["what are disabilities?", "what is a disability?", "define disabilities", "define disability?", "Tell me more about disabilities", "What do you know about disabilities?", "What are disabilities about?", "describe what disabilities are.", "could you tell me about disabilities?", "describe disabilities", "describe a disability"],
        "responses":[
            "A disability is any condition of the body or mind (impairment) that makes it more difficult for the person with the condition to do certain activities (activity limitation) and interact with the world around them (participation restrictions).",
            "A disability is any condition that makes it more difficult for a person to do certain activities or effectively interact with the world around them (socially or materially). These conditions, or impairments, may be cognitive, developmental, intellectual, mental, physical, sensory, or a combination of multiple factors.",
            "A disability is a physical, mental, cognitive, or developmental condition that impairs, interferes with, or limits a person's ability to engage in certain tasks or actions or participate in typical daily activities and interactions",
            "A person with a disability is someone who has a physical or mental impairment that substantially limits one or more major life activity. Disabilities can be visible or invisible, something a person is born with or acquired at any point in life."
          ]
      },
      {
        "tag":"disability_type",
        "input":["what types of disabilities are there?", "How many disability types are there?", "describe types of disabilities", "describe disability types?", "what categories of disabilities are there?", "describe categories of disabilities", "What are disabilities about?", "describe what disabilities are.", "what are the types of disabilities?", "what are the categories of disabilities?", "list disability types", "list disability categories","how are disabilities classified?", "how are disabilities categorized?"],
          "responses":[
              "There are many types of disabilities, such as those that affect a person's: \nVision \nMovement \nThinking \nRemembering \nLearning \nCommunicating \nHearing \nMental health \nSocial relationships",
              "The main categories of disability are physical, sensory, psychiatric, neurological, cognitive and intellectual. A physical disability is the most common type of disability, followed by intellectual and sensory disability.",
              "A disability is a physical, mental, cognitive, or developmental condition that impairs, interferes with, or limits a person's ability to engage in certain tasks or actions or participate in typical daily activities and interactions",
              "The four major types of disabilities include physical, developmental, behavioral or emotional, and sensory impaired disorders. While many disabilities fall under one of these four umbrellas, many can fall under two or more."
            ]
      },

      {
        "tag":"disabled_support",
        "input":["How to support disabled people?", "How to support disabled persons?", "How to help disabled people?", "How to help disabled persons?", "How to help people with disabilities?", "How to assist people with disabilities?", "how to support people with disabilities?", "how to support people with impairments?", "how to help people with impairments?", "how to assist people with impairments?", "how to support people with impediments?", "how to assist people with impediments","how to help people with impediments?", "tips for supporting disabled people", "tips for assisting disabled people", "tips for supporting disabled people"],
          "responses":[
              "Here are 7 different ways you can support disabled persons in your community: \n1. Ask Before Offering Help - Don't assume that people with disabilities would always require some assistance in leading their lives and the first step is to treat them as equals. Understand that they know more about their needs and how to handle their day-today lives. \n2. Make Them Feel Confident - Few disabled people may suffer from lack of self-esteem and confidence. Remember, many of them don't like sympathy and don't stare at them. Always make eye contact while talking and do not try to strike up a conversation around their disabilities. If you are conversing with a person in a wheelchair sit down and talk face-to-face, instead of talking down to them. \n3. Respect Personal Space - People with disabilities need their own space and may not like others touching their mobility aids without permission, as you may not know how to handle their equipment. If you want to move their wheelchair, ask for permission. Always knock on the doors before you enter the room, like you do with others. Do not discuss their disability with others. \n4. Make Accomodating Changes - If you are expecting a visitor with certain disability at home or in office, try making few simple changes that would make them feel comfortable. Place necessary items within their reach in restrooms, bedrooms, offer to help with items in shelves or cupboards. Also try and respect their daily routine and if there is a sudden change in the daily activities help them to cope up with the transition. \n5. Engage In Positive Conversations - While maintaining social distancing is the need of the hour to halt the further spread of coronavirus infection, keep in mind to not completely isolate the disabled in your community. Meet with visually challenged or physically handicapped people and talk to them about constructive topics like work, family, music or discuss happy memories from the past. This helps persons with disabilities have a sense of belonging and uplifts their overall mood and mental health in these tough times. \n6. Offer Help With Medical Support - While it is quite simple for us to stock up on all our nutrition supplements and immunity boosters, go for health check-ups, consult a doctor online, besides buying any medications for other pre-existing conditions, it is not so easy for disabled people to acquire their healthcare needs amidst current partial lockdowns. Identify these people in your neighbourhood, sit down with them and help them order all their medicines online, set up doctor's appointments virtually or take them to a nearby clinic for their routine medical check-ups. \n7. Ensure They Receive Day-To-Day Needs - In these times of widespread infectious disease, it is very important to eat healthily and take meals on time. During the day, check up on your neighbours with disabilities, to make sure they have ample groceries and foodstuffs stocked up in their homes, to avoid going out frequently. In case they find it difficult to do so, go ahead and help them purchase their essential supplies online, ensure it gets delivered to their homes and their caretakers, house help is present every day to cook meals and provide them with nourishing food.",
              "To effectively communicate with disabed persons in a way that makes feel welcome and included in your community; \n1. Stay natural - Alright, it's easier said than done… But you need to realize that the person in front of you is above all a human being with the same needs as anyone. Meaning that past the initial moment of surprise, even the moment of panic (because this can also happen…), you simply have to say hello and start talking to the person in front of you. \n2. Ask Questions - Yes, it's a new situation and yes, it's normal not to have all the keys in hand. Simply ask the person you're talking with what you can do for them. They know best how to explain it to you. \n3. Don't think for them - Because we want to do things right, we often tend to anticipate what a person with disabilities will say or do. But it's a trap! There's a good chance you'll be wide of the mark concerning their expectations and this may cause frustration that could make the person with disabilities aggressive towards you! Give them time to express themselves \n4. Offer your help, don't impose it - Some people with disabilities don't dare to ask for help. You'll make it easier for them if the offer to help comes from you. But do it in an open way so that the person you're talking to can feel free to tell you if they need it or not. \n5. Make sure you're talking to the person with disabilities before anything else - If a person with disabilities is with someone like a caregiver, this doesn't necessarily mean that they can't communicate with you. It's in fact rarely the case. But even if it was, it's not a reason to ignore them in the conversation. Just speak directly to them. The caregiver they're with will naturally take over if it's necessary.",
              "Here are 6 ways you can support people living with disabilities: \n1. Ask first ad follow their lead - Don't assume people need help. Ask if they need anything to make the process more effective or easier for them. They are the experts on their needs and how to best meet them. If they do ask for help, ask for specific instructions on how you can help. \n2. Speak clearly, listen well if necessary - If you are working with a person who has a developmental disability or other cognitive issues, use clear sentences, simple words and concrete concepts. Gauge the pace, complexity and vocabulary of your speech to match theirs. Unless you are informed otherwise, remember they can make their own decisions. Allow people with speech impairments to finish their own sentences. Don't talk for them or interrupt. \n3. Speak directly to people - Make eye contact and speak to people directly, even if their personal care attendant or interpreter is with them. When a person who is deaf has an interpreter, the user will look at the interpreter as you are talking. While this is happening, focus your interaction with the user. Also, if you will be speaking for some time with a person in a wheelchair, sit down so they don't have to strain their neck to look up at you. Do not lean over a person in a wheelchair. \n4. Be aware of personal space - Some people who use a mobility aid, such as a wheelchair, walker or cane, see these aids as part of their personal space. Similarly, never start to push someone's wheelchair without first asking the occupant's permission. Don't touch, move or lean on mobility aids. This is also important for safety. \n5. Be flexible to family members of people with disabilities - Many people with disabilities have family members who care for or provide companionship. In many cases, the spouse of a person with disability may leave the workforce because of their spouse's needs. Being flexible to the needs of family members keeps British Columbians in the workforce and reduces any compounded impact on the household and the province's labour force. \n6. When setting meetings, check accessibility - Confirm a meeting place in advance of the meeting and send detailed instructions on the accessibility of the venue. Ask if there is anything you can do to prepare for the meeting to make sure everyone is able to participate fully.",
              "There are numerous ways to make society more inclusive for people with disabilities. They include; \n1. View the Disability Community as a Valuable Consumer - It's still progressive to see the disability community as a targeted audience and consumer. We're the biggest minority population in the world, yet the most under represented when it comes to marketing products, as we're the last to be thought of. While part of this stems from the fact that there is a great deal of diversity within the disability community, those consumer segments (and their families) still have significant purchasing power. We're slowly seeing models with disabilities incorporated in fashion and marketing commercials, but this needs to become the norm, and not seen as future-forward thinking. \n2. Employ People with Disabilities- They are Ambitious and Want to Work - According to NPR, 'fewer than 1 in 5 disabled adults are employed.' CNN Money also stated that, 'disabled workers earn about $9,000 less a year than non-disabled workers, according to Census data on median earnings. That gap was under $6,000 in the early 1990s.' The disability community is still discriminated against at work from being refused a job or denied a final interview. But when it comes down to it, employers need to see a person, including his/her disability, as an asset and not a potential liability. \n3. Promote Social Inclusion in Schools - Our overall cultural consciousness on how we treat and interact with disability needs to change, beginning in elementary schools. We need to celebrate our peers for their differences. If this is taught at a young age, less discrimination and more social inclusion will occur. Having kids with and without disabilities learning side-by-side helps everybody appreciate the talents and gifts all kids bring with them. As a society, we have the responsibility to promote the inclusion of our differences. \n4. Provide College Scholarships to Athletes with Disabilities - Athletes with disabilities should be scouted and receive scholarships based on their athletic abilities by their chosen school. When I was a senior in high school, regardless that I was selected to represent Team Kenya in international meets, I was never scouted nor received a college scholarship offer for my athletic abilities because my times never compared to my able-bodied counterparts. My disability was seen as an inspiration to the institution rather than being acknowledged as a hardworking teammate who contributed points in meets. This needs to change for our younger generation."
            ]
      },

      {
        "tag" : "visual_impairment_comms_tips",
        "input" : ["Give me tips for engaging with blind persons", "Give me tips for engaging with blind people", "Give me tips for engaging with visually impaired people", "Give me tips for engaging with visually impaired persons", "How to talk to blind persons", "How to talk to blind people", "How to talk to visually impaired persons", "How to talk to visually impaired people", "How to communicate with visually impaired people?", "How to communicate with visually impaired persons?", "how to communicate with blind people", "how to communicate with blind persons", "how to speak to blind persons", "how to speak to blind people", "how to speak to visually impaired people", "how to speak to visually impaired persons", "how to engage with visually impaired people", "how to engage with visually impaired persons", "how to engage with blind people", "how to engage with blind persons"],
        "responses" : ["When communicationg with blind or visually impaired persons, it is important to: \n1. Understand that legally blind people may have some vision. \n2. Offer your arm/elbow when leading someone who is blind. \n3. Place the person's hand on the side or back of the chair when seating them. \n4. Provide class information in accessible, electronic formats to support the individual in using their technology to speak content aloud. \n5. Provide very explicit and specific directions if asked. Avoid using such terms as “over there” or “turn this way”. \n6. Never pet, feed or otherwise distract a service animal without first getting permission from the owner.",
                      "To effectively communicate with visually impaired individuals while showing proper courtesy one should: \n1. Offer help - If you see a person with blindness who seems to need help, offer your services. Speak directly to them, not through a third party, and let them know you are addressing them. If your help is refused, that's okay! \n2. Assist, don't push - Pushing isn't polite. If you want to assist an individual with blindness, offer your arm. Taking your arm will allow them to follow the motions of your body. If they have a guide dog, ask if they'd prefer to take your arm or follow you. \n3. Communicate when you are leaving - Before parting ways with a person who is blind, ask them if they need any more assistance. If they do not require anything further, let them know you are leaving.  \n4. Give helpful directions - Always give directions to a person with blindness according to the way they are facing. Pointing and giving vague descriptions, such as “over there”, won't help. Let them know specifics, “Go straight for about five feet and the door is to the right” If you must use specific street or landmark names, make sure they are familiar with the area. \n5. Dont change your vocabulary - It's okay to use words like “look” and “see” when conversing with a person who is blind. Words like these are likely as much a part of their vocabulary as yours. \n6. Leave things where they are - When visiting a person who has blindness' home or office, don't move objects around. Even if you think you're helping, you may be doing more harm than good. Chances are, the person with blindness knows where they keep things and expects objects to be where they placed them. \n7. No sight, no limits - Most people who are blind will gladly discuss blindness if asked, but remember that it's an old story to them. They have just as many interests as you do. Don't make the assumption that their blindness rules their life.",
                      "The following points of etiquette shared by the American Foundation for the Blind (www.afb.org) are helpful to keep in mind when interacting with a person who is visually impaired: \n1. Introduce yourself using your name and/or position, especially if you are wearing a name badge containing this information. \n2. Speak directly to the person not through a companion, guide, or other individual. \n3. Speak to the person using a natural conversational tone and speed. Do not speak loudly and slowly unless the person also has a hearing impairment. \n4. Address the person by name when possible. This is especially important in crowded areas. \n5. Immediately greet the person when they enter a room or a service area. This allows you to let them know you are present and ready to assist. And, it eliminates uncomfortable silences. \n6. Indicate the end of a conversation to avoid the embarrassment of leaving a person speaking when no one is actually there. \n7. Feel free to use words that refer to vision during the course of conversations. Vision-oriented words such as look, see and watching TV are a part of everyday verbal communication. The words blind and visually impaired are also acceptable in conversation. \n8. Be precise and thorough when you describe people, places or things. Don't leave things out or change a description because you think it is unimportant or unpleasant. \n9.Feel free to use visually descriptive language. Making reference to colors, patterns, designs, and shapes is perfectly acceptable. \n10. Speak about a person with a disability by first referring to the person and then to the disability. You should, therefore, refer to 'persons who are blind' rather than to 'blind persons. \n11. Offer to guide a person who is blind or visually impaired by asking if they would like assistance. Offer them your arm. It is not always necessary to provide guided assistance; in some instances it can be disorienting and disruptive. Respect the desires of the person you are with.' \n12. Guide persons who request assistance by allowing them to take your arm just above the elbow when your arm is bent. Walk ahead of the person you are guiding. Never grab a person who is blind or visually impaired by the arm and push him/her forward."          
                    ]
      },

      {
        "tag":"speech_impairment_comms_tips",
        "input":["Give me tips for engaging with dumb persons?", "Give me tips for engaging with speech impaired persons?", "How to talk to a person who can't talk?", "How to talk to a person who can't speak?", "How to speak to a person who can't speak?", "How to talk to a person who is dumb?", "How to speak to a person who is dumb?", "How to speak to people who are dumb?", "How to talk to people who are dumb?", "how to communicate with dumb people?", "how to communicate with dumb persons?", "how to communicate with people with speech impairments","how to communicate with people with speech impediments?", "tips for communicating with dumb people", "tips for communicating with speech impaired people", "tips for communicating with people who can't talk", "tips for communicating with people who can't speak", "tips for communicating with people with speech impediments", "how to talk to people with speech impediments", "how to talk with people who cannot talk", "how to talk with people who cannot speak", "how to engage with people who cannot talk", " how to engage with people who cannot speak", "how to engage with people who cannot communicate"],
          "responses":[
              "I would recommend different ways you can support persons with speech impairments in your community: \n1. Allow time for the person to speak, as they may need more time to respond to you. \n2. Avoid the urge to interrupt or complete a sentence for the person. \n3. Politely ask for repetition if you do not understand what the person said. \n4. Do not fake understanding. \n5. Be aware that you may need to use a variety of communication methods such as writing notes, emailing, or technological options.. \n6. Be patient and encourage the person toward expression.",
              "To effectively communicate with persons living with speech impediments in a way that makes feel welcome and included in your community; \n1. Reduce Distractions - Ensuring the radio or TV aren't loud can help both the speaker to better articulate what they want to say and understand what you say. But it can help the listener to focus and hear what the speaker is saying too. \n2. Break things down - Using shorter, less complicated sentences and stressing the key words in the sentence can help the person better hear and understand you. For instance, instead of saying 'I was thinking maybe you'd like to go out for something to eat tonight? Where should we go?' you might say 'Shall we eat out? Italian or Chinese?' \n3. Use non-verbal communication - If a person is struggling to understand what is said, this may be helped by using pictures, facial expression, tone of voice, gesture or writing to support what you're saying. \n4. Ask what kind of help they would like - It's useful if families and friends can agree with the person how much help he or she wants. Some people like help at appointments but not at home. Others like help when they're tired. Some don't like others 'talking for them'. If you're not sure and see someone struggling, ask if they would like help. \n5. Talk around - Talking around (or circumlocution) is when someone describes what they're trying to remember to help themselves, or someone else, recall the word. For instance, if you know they want to ask about steroid tablets but can't get the word out you could say 'you wanted to ask about the tablet. It's the little blue one you take. You take 4mg a day and see if this helps. \n6. Give them options - You can also try offering two options, for instance 'did you want to ask about your radiotherapy or your steroids?' The person may then find it easier to recall the word once they've heard it.",
              "Here are a number of ways you can support people living with speech impairments: \n1. Encourage them to be aware - It can help to encourage the person speaking to monitor their speech, and be aware of it, as it might vary during the day, with good and less good times. \n2. Ask for the topic - Asking the person to give you a topic first to narrow down the conversation can help you understand what they want to say. \n3. Be Honest - If you missed the conversation starting say so. Be honest and say 'I'm sorry I wasn't paying attention then'. Or, if you haven't understood something, let them know. Pretending can make them feel frustrated and you might miss something important too. \n4. Repeat what you did hear - Repeating back what you did understand means the person doesn't have to repeat the whole sentence again, which can be frustrating and tiring. \n5. Don't anticipate a problem - Often people feel they can't find the right word even though it's a familiar word. But anticipating the problem can increase the stress a person feels and make it more difficult for them to recall. \n6. Speak at the same volume - Don't be tempted to speak more loudly, remember the person doesn't have a problem with their hearing. \n7. Rephrase what you have said - If they haven't understood you, try rephrasing rather than repeating.",
              "Speech is an important part of our daily lives and interactions. When a consumer has trouble speaking clearly, it presents barriers to effective communication and can make it difficult to perform your duties as a provider. It might feel uncomfortable for you to communicate with a consumer who is hard to understand. Speech impediments can add difficulty in communicating with your consumer but need not prevent a normal and fulfilling communicative process or interfere with your work as a provider. There are simple actions you can take to help a consumer with a speech impediment feel comfortable and communicate most effectively. \n 1. Remember, it may be only the speech that's impaired - Many people have trouble speaking without any other disabilities or difficulties. Do not assume that you must speak slowly or use simple language around someone with a speech impediment. The consumer might hear and understand you but have trouble speaking or responding. Speak clearly and distinctly but naturally, and be aware that the consumer might feel like you are “talking down” to him/her if you speak too slowly. It might be useful to use 'yes or no' questions depending on the severity of the speech impediment. \n2. Do not be afraid to ask the consumer to repeat him/herself - People who stutter or fumble with words or do not speak clearly usually know that they can be difficult to understand. Everyone wants to be heard and understood, so if you did not catch what a consumer with a speech impediment said, let them know so they can make their point. You can also repeat back to the consumer what you have understood to make sure it is correct. \n3. Be careful about other corrections - It may be tempting to tell your consumer to “slow down” or “take a deep breath” but these suggestions may not help the situation and might actually make communication more difficult. Corrections of this kind might make the consumer nervous which could cause the speech impediment to worsen. In addition, finishing your consumer's sentences can be frustrating and cause the consumer to feel rushed. \n4. Use other clues - Speech is not the only form of communication. Watch the consumer's face, reaction, and body language (including facial or hand responses), as these may help you in understanding. Be an active listener: look for hints from eye gaze and gestures and then take a guess (e.g. 'Are you talking about the TV news? Yes? Tell me more. I didn't see it.'). \n5. Be Patient - Be willing to work at communicating. In some cases, this may mean learning basic sign language or being aware of special communication devices for consumers who are nonverbal. If appropriate, become familiar with devices, systems, and programs which have been developed to assist. Do not be afraid to ask the consumer if there are ways to improve communication with him/her or ask the consumer's family or friends any tips they have learned."
            ]
      },

      {
        "tag":"hearing_impairment_comms_tips",
        "input":["Give me tips for engaging with deaf persons?", "Give me tips for engaging with hearing impaired persons?", "How to talk to a person who can't hear?", "How to talk to a person who can't listen?", "How to speak to a person who finds it hard to hear?", "How to talk to a person who is deaf?", "How to speak to a person who is deaf?", "How to speak to people who are deaf?", "How to talk with people who are deaf?", "how to communicate with deaf people?", "how to engage with deaf persons?", "how to communicate with people with hearing impairments","how to communicate with people with hearing impediments?", "tips for communicating with deaf people", "tips for communicating with hearing impaired people", "tips for communicating with people who can't hear", "tips for communicating with people who can't listen", "tips for communicating with people with hearing impediments", "how to talk to people with hearing impediments", "how to talk with people who cannot hear", "how to talk with people who cannot listen", "how to engage with people who cannot hear", " how to engage with people who cannot listen", "how to engage with people who are hearing impaired"],
          "responses":[
              "Communicating with someone who has hearing loss is often frustrating, and that frustration goes both ways. Instead of letting those with hearing loss continue to sit in silence, follow your Los Angeles audiologist's tips on how to communicate better.\n1. Maintain eye contact with the hearing impaired individual, facing them directly. Do not attempt to hold a conversation from another room; visual cues are an important component of successful communication. \n2. Make sure you have the person's attention before beginning a conversation. It helps to state their name so they are aware you are addressing them and can focus on your words. \n 3. Speak slowly and concisely. Resist the temptation to shout, which can lead to distorted speech and make your words more difficult to understand. Pause between sentences to ensure what you are saying is understood. \n4. Do not cover your face with your hands or other objects. Individuals with hearing loss rely on visual cues to help follow the conversation, and sometimes find lip reading helpful.\n 5. Avoid eating and drinking while conversing. Not only is it rude to talk with your mouth full, it can make your words much harder to understand. \n6. Try to find a quiet area free of background noise. This can be distracting and cause the hearing impaired individual to miss out on much of what you are saying. \n7. Repeat yourself if necessary. Try using a different word or rephrasing your sentence if it is too confusing. Refrain from complex words and phrases. \n8. Supplement your conversation by writing down important information. This might include jotting down the topic you will be discussing beforehand. \n9. Pay attention to the listener. If they look confused, offer to clarify what you have just said. \n10. Remember, communication is a two-way street. Give the other person a chance to speak, and do not interrupt.",
              "Successful communication requires the efforts of all people involved in a conversation. Even when the person with hearing loss utilizes hearing aids and active listening strategies, it is crucial that others involved in the communication process consistently use good communication strategies, including the following: \n1. Face the hearing-impaired person directly, on the same level and in good light whenever possible. Position yourself so that the light is shining on the speaker's face, not in the eyes of the listener. \n2. Do not talk from another room. Not being able to see each other when talking is a common reason people have difficulty understanding what is said. \n3. Speak clearly, slowly, distinctly, but naturally, without shouting or exaggerating mouth movements. Shouting distorts the sound of speech and may make speech reading more difficult. \n4. Say the person's name before beginning a conversation. This gives the listener a chance to focus attention and reduces the chance of missing words at the beginning of the conversation. \n5. Avoid talking too rapidly or using sentences that are too complex. Slow down a little, pause between sentences or phrases, and wait to make sure you have been understood before going on. \n6. Keep your hands away from your face while talking. If you are eating, chewing, smoking, etc. while talking, your speech will be more difficult to understand. Beards and moustaches can also interfere with the ability of the hearing impaired to speech read. \n7. If the hearing-impaired listener hears better in one ear than the other, try to make a point of remembering which ear is better so that you will know where to position yourself. \n8. Be aware of possible distortion of sounds for the hearing-impaired person. They may hear your voice, but still may have difficulty understanding some words. \n9. Most hearing-impaired people have greater difficulty understanding speech when there is background noise. Try to minimize extraneous noise when talking. \n10. Some people with hearing loss are very sensitive to loud sounds. This reduced tolerance for loud sounds is not uncommon. Avoid situations where there will be loud sounds when possible. \n11. If the hearing-impaired person has difficulty understanding a particular phrase or word, try to find a different way of saying the same thing, rather than repeating the original words over and over. \n12. Acquaint the listener with the general topic of the conversation. Avoid sudden changes of topic. If the subject is changed, tell the hearing impaired person what you are talking about now. In a group setting, repeat questions or key facts before continuing with the discussion. \n13. If you are giving specific information - such as time, place or phone numbers - to someone who is hearing impaired, have them repeat the specifics back to you. Many numbers and words sound alike. \n14. Whenever possible, provide pertinent information in writing, such as directions, schedules, work assignments, etc. \n15. Recognize that everyone, especially the hard-of-hearing, has a harder time hearing and understanding when ill or tired. \n16. Pay attention to the listener. A puzzled look may indicate misunderstanding. Tactfully ask the hearing-impaired person if they understood you, or ask leading questions so you know your message got across.",
              "Tips for communicating with people with hearing impairment \n 1. Place yourself where they can see you to gain attention, or lightly touch their shoulder. \n2. Position yourself to ensure maximum light on your face. \n3. Always face the person - do not turn away or cover your mouth. \n4. Don't provide unnecessary detail - keep sentences short \n5. If necessary use a pen and paper to communicate. \n6. Be flexible - if a person doesn't understand something you say, reword it instead of repeating it. \n7. Don't be embarrassed if you use phrases like “did you hear about."
            ]
      },

      {
        "tag":"learning_impairment_comms_tips",
        "input":["Give me tips for engaging with learning impaired persons?", "Give me tips for engaging with learning disabled persons?", "How to talk to a person who is a slow learner?", "How to talk to people who learn slowly?", "How to speak to a person who finds it hard to learn?", "How to talk to a person who is a slow learner?", "How to speak to a person who is on crutches?", "How to speak to people with dyslexia?", "How to talk with people who have dyslexia?", "how to communicate with people with dyslexia?", "how to communicate with persons with dyslexia", "how to communicate with people with learning disability","how to communicate with learning disabled persons?", "tips for communicating with learning impaired people", "tips for communicating with learning disabled persons", "tips for communicating with people who can't learn", "tips for communicating with people who have learning problems", "tips for communicating with people with learning impediments", "how to talk to people with learning disabilities", "how to talk with people who is dyslexic", "how to talk with people who have dyslexia", "how to engage with people who cannot learn properly", " how to engage with people who have a learning disorder", "how to engage with persons who have learning disorders."],
          "responses":[
              "1. Understand that learning disabilities may impact a person's reading, writing, math, memory, and/or information processing. \n2. Realize that this is rarely visible evidence of learning disabilities. \n 3. Use multiple methods to deliver information. \n4. Minimize environment distractions (screen savers, background noises, etc.). \n 5. Keep in mind that an unconventional response may be influenced by a processing difficulty which affects social interaction.",
              "A learning disability can make communicating and processing information more difficult. Therefore, it is important to know about the different ways to communicate with children, young adults or adults with learning disabilities.  This includes the following communication methods: \n· Non-verbal communication with learning disabilities \n· Verbal communication with learning disabilities \n· Alternative forms of communication for learning disabilities (resources and technology).\n\nTips for verbal communication with learning disabilities \n It is important to be empathetic and clear when having a conversation with someone who has a learning disability. When talking to someone with a learning disability: \n1. Ask the person with a learning disability how they would best like to communicate. \n2. Use words & phrases that are accessible. \n3. Let the person you are talking to lead the conversation. \n4. Ask open questions instead of 'yes' and 'no' questions. It can be difficult for someone with a learning disability to process the meaning of questions. \n5. Try not to use phrases, idioms or long words that might be hard to understand. \n6. Do not rush the person you are talking to. \n7. Make sure you have understood what the person was meaning to say. \n8. Check that you have understood what someone was saying by asking them (e.g., 'I understood this..., is that right?'). \n\n\nTips for non-verbal communication with learning disabilities \nA learning disability can make it more challenging for people to take in information, especially if it is complex and dense. When creating written communication for someone with a learning disability:\n·     Keep information simple and concise.\n·     Use large text, bullet points and not too much colour. \n·     Make sure you use a clear page lay-out. \n Use pictures to represent what is written. \n\n\nLearning disabilities resources for communication.\nCertain resources and technology can help people with learning disabilities to communicate or engage with information. These alternative forms of communication for learning disabilities are worth utilising if they work well for the individual you care for. Most learning disability communication skills resources use learning disability communication symbols. 3 of the best resources for people with learning disabilities include:\n 1. Makaton - a programme that helps children or adults with learning disabilities to communicate independently. It utilises learning disability communication symbols, signs and speech. \n 2. Talking mats - make communication simpler and easier. They help people with learning disabilities to organise their thoughts and express their feelings. \n 3. Widgit - creates software symbols to help people with learning disabilities understand information, and communicate easier. Widgit is very useful for people with learning disabilities that use computers and technology."
            ]
      },
      
      {
        "tag":"disability_rights",
        "input":["What are the rights of disabled people?", "What are the rights of disabled persons?", "What rights and freedoms to people with disabilities in Kenya?", "Describe the fundamental rights & freedoms of disabled people in Kenya?", "Describe the rights of disabled persons", "Rights of impaired people in Kenya?", "Rights of disabled persons", "What freedoms do disabled people have", "What are the rights of physically impaired persons", "Describe the rights of people with disabilities", "Do disabled people have human rights?", "What are the human rights for disabled persons","Describe the human rights of disabled people?", "Human rights of people with disabilities.", "Do persons with disability have any rights?", "What does the Constitution say about disabilities?", "What constitutional rights amendments has affected people with disabilities?"],
          "responses":[
              "Kenya's constituition elaborately states the fundamental rights and freedoms of disabled persons. In summary, a person with any disability is entitled: \n\n1. to be treated with dignity and respect and to be addressed and referred to in a manner that is not demeaning. \n2. to access educational institutions and facilities for persons with disabilities that are integrated into society to the extent compatible with the interests of the person. \n3. to reasonable access to all places, public transport and information. \n4. to use Sign language, Braille or other appropriate means of communication. \n5. to access materials and devices to overcome constraints arising from the person's disability.\n\nThe State shall ensure the progressive implementation of the principle that at least five percent of the members of the public in elective and appointive bodies are persons with disabilities." ,
              "Rights & privileges of persons with disabilities. \nThe Persons with Disabilities Act of the 2010 Kenyan Constituition states that The Government shall take steps to the maximum of its available resources with a view to achieving the full realization of the rights of persons with disabilities set out in this Part.\n\n1. Employment  \na) No person shall deny a person with a disability access to opportunities for suitable employment.\nb) A qualified employee with a disability shall be subject to the same terms and conditions of employment and the same compensation, privileges, benefits, fringe benefits, incentives or allowances as qualified able-bodied employees. \nc) An employee with a disability shall be entitled to exemption from tax on all income accruing from his employment. \n2. Reservation of employment - The Council shall endeavour to secure the reservation of five per cent of all casual, emergency and contractual positions in employment in the public and private sectors for persons with disabilities. \n Apprenticeship \nSubject to the provisions of the Employment Act, persons with disabilities shall be eligible for engagement as apprentices or learners where their disability is not such as to impede their performance in particular occupations for periods for which they are hired. \n4. Discrimintion by employers prohibited \nNo employer shall discriminate against a person with a disability in relation to; the advertisement of employment, the recruitment for employment, the creation, classification or abolition of posts, the determination or allocation of wages, salaries, pensions, accommodation, leave or other such benefits; (e) the choice of persons for posts, training, advancement, apprenticeships, transfer, promotion or retrenchment; the provision of facilities related to or connected with employment; or any other matter related to employment.\n6. Education \nNo person or learning institution shall deny admission to a person with a disability to any course of study by reason only of such disability, if the person has the ability to acquire substantial learning in that course. \nLearning institutions shall take into account the special needs of persons with disabilities with respect to the entry requirements, pass marks, curriculum, examinations, auxilliary services, use of school facilities, class schedules, physical education requirements and other similar considerations.\nSpecial schools and institutions, especially for the deaf, the blind and the mentally retarded, shall be established to cater for formal education, skills development and self-reliance.\n7. Accessibility & Mobility \nPersons with disabilities are entitled to a barrier-free and disability-friendly environment to enable them to have access to buildings, roads and other social amenities, and assistive devices and other equipment to promote their mobility."
            ]
      },

      {
        "tag":"disability_organisations",
        "input":["Which registered national disabled persons organizations are in Kenya?", "What organisations oversee rights of disabled persons in Kenya?", "Which organisations help disabled persons in Kenya?", "Which NGOs help impaired persons in Kenya", "Which organisations help people with disabilities in Kenya", "List Kenyan NGOs that help persons with disabilities?", "List Kenyan organisations that help people with disabilities", "Which agencies help people with disabilities", "Which agencies help people with impairments", "List agencies for disabled persons in Kenya", "List organisations for persons with disabilities", "Which organisations are for persons with disabilities","Which organizations focus on the welfare of people with physical disabilities", "Which government agencies help people with disabilities in Kenya"], 
          "responses":[
              "1. National Council for Persons with Disabilities. (NCPWD) - The National Council for Persons with Disabilities is a state corporation established by an Act of Parliament; the Persons with Disabilities Act No. 14 of 2003 and set up in November 2004. The Council representation is drawn from key government Ministries and organizations of/for persons with disabilities. To promote and protect equalization of opportunities and realization of human rights for PWDs to live decent livelihoods. The National Council for persons with disabilities in conjunction with our parent ministry, ministry of labour and social protection on 27th June 2019 Launched 2018-2022 Council strategic plan the occasion was graced by Hon.Ukur Yattani CS for Labour, Hon. David Sankok Nominated member of Parliament, PS Nelson Marwa and other dignitaries from different public and private sectors.\n\n2. Association for the Physicaly Disabled of Kenya - APDK is a charitable not-for-profit, Non-governmental Organization that is committed towards improving the lives of persons with disability through advocating for an inclusive society, provision of rehabilitation services (physio- and Occupational Therapy) provision of appropriate wheelchairs and assistive technology (crutches, walking frames, surgical boots), economical empowered and advocating for rights of persons with disability.\n\n3. The United Siabled Persons of Kenya (UDPK) - The United Disabled Persons of Kenya(UDPK) is the Umbrella organization of Disabled Persons Organizations in Kenya.It was established in the year 1989,with head office in Nairobi.UDPK is mandated to Advocate for the Rights of persons with disability.Promoting PWDs equal access to opportunities and active participation to mainstream development processes.Through its membership of over 200 Disabled Persons Organization,UDPK targets to reach all disabled population county wide.\n\n4. Action Networkfor the Disabled  - Action Network for the Disabled (ANDY) is a National Disabled Persons Organization (DPO) working at all levels of community with the involvement of persons with disabilities to bring about positive change. We were founded by and for children and youth with disabilities in Kenya." ,
              "1. National Council for Persons with Disabilities. (NCPWD) - The National Council for Persons with Disabilities is a state corporation established by an Act of Parliament; the Persons with Disabilities Act No. 14 of 2003 and set up in November 2004. The Council representation is drawn from key government Ministries and organizations of/for persons with disabilities. To promote and protect equalization of opportunities and realization of human rights for PWDs to live decent livelihoods. The National Council for persons with disabilities in conjunction with our parent ministry, ministry of labour and social protection on 27th June 2019 Launched 2018-2022 Council strategic plan the occasion was graced by Hon.Ukur Yattani CS for Labour, Hon. David Sankok Nominated member of Parliament, PS Nelson Marwa and other dignitaries from different public and private sectors.\n\n2. Association for the Physicaly Disabled of Kenya - APDK is a charitable not-for-profit, Non-governmental Organization that is committed towards improving the lives of persons with disability through advocating for an inclusive society, provision of rehabilitation services (physio- and Occupational Therapy) provision of appropriate wheelchairs and assistive technology (crutches, walking frames, surgical boots), economical empowered and advocating for rights of persons with disability.\n\n3. The United Siabled Persons of Kenya (UDPK) - The United Disabled Persons of Kenya(UDPK) is the Umbrella organization of Disabled Persons Organizations in Kenya.It was established in the year 1989,with head office in Nairobi.UDPK is mandated to Advocate for the Rights of persons with disability.Promoting PWDs equal access to opportunities and active participation to mainstream development processes.Through its membership of over 200 Disabled Persons Organization,UDPK targets to reach all disabled population county wide.\n\n4. Action Networkfor the Disabled  - Action Network for the Disabled (ANDY) is a National Disabled Persons Organization (DPO) working at all levels of community with the involvement of persons with disabilities to bring about positive change. We were founded by and for children and youth with disabilities in Kenya. "
            ]
      },
      {
        "tag": "disability_illnesses",
        "input": ["Which illnesses are disability related", "Which diseases are disability related", "Describe the type of illnesses related to disabilities", "Describe the type of diseases related to disabilities", "Describe the type of illnesses related to disabilities", "What type of diseases are linked to disabilities", "What type of diseases are linked to impairments", "What kind of illnesses do people with disabilities suffer from", "What kind of diseases do people with impediments suffer from", "What kind of diseases do disabled people suffer from?", "What are common illnesses linked to disabled persons", "What are common diseases disabled persons suffer from", "List common disability related diseases", "Common disability related illnesses", "What are the recognised disabilities", "What are the most common disabilities", "What illnesses are classed as a disability", "What diseases are classified as disabilities", "What counts as disability", "What illnesses qualify as disabilities", "What diseases qualify as disabilities", "What diagnosis qualifies for disability", "What medical conditions qualify for disability", "What medical conditions are considered disabilities"],
        "responses": ["Some of the medical conditions that are recognised by Kenya's government & may automatically qualify for social security disability benefits include:\n\n1. Musculoskeletal System and Connective Tissue \nThe SSA reports that the largest category of diagnoses among disabled workers receiving disability benefits was diseases of the musculoskeletal system and connective tissue. These disabilities, which represented 32.3 percent of the diagnoses, involve damage to one's nerves, muscles, tendons or ligaments. Examples of this type of disorder include:\na. Arthritis - An individual with rheumatoid arthritis, a disorder of the immune system, must experience significant limits on his or her ability to work to qualify for benefits under this medical diagnosis. Rheumatoid arthritis is sometimes referred to as a connective tissue disorder.\nb. Reflex Sympathetic Dystrophy (RSD) — RSD describes a range of symptoms that may occur from injury, diseases or surgery. RSD is characterized by intense burning or aching pain typically caused by trauma to a single extremity.\n\n2. Mental Disorders\nAccording to the SSA, nearly 20 percent of disability benefits were awarded to individuals with qualifying mental disorders. Individuals must have a medically diagnosed mental condition and it must cause an extreme limitation in an individual's ability to function independently. The Social Security Administration groups mental disorders into broad categories, including:\na. Mood disorders (anxiety, depression, panic attacks) - To qualify for disability, the anxiety disorder or depression must cause limitations in the ability to understand and apply information, to have social interactions with others, to concentrate and to manage oneself.\nb. Schizophrenia or other psychotic disorders - Disability claims reviewers look for medical documentations that the individual has delusions or hallucinations, and disorganized thinking.\nc. Organic mental disorder - The criteria for Social Security Disability benefits based on organic mental disorder, also known as organic brain syndrome, vary with the particular disorder, but typically involve a doctor's documentation that an individual has shown one or more symptoms of organic mental disorder such as confusion, loss of cognitive ability and memory loss.\nd. Post-traumatic stress disorder (PTSD) - Post-traumatic stress is a type of anxiety disorder. A person with PTSD may qualify as having a disabling mood disorder if the condition is properly medically documented. \nAutism or Asperger's syndrome - Individuals with Autism spectrum disorders may qualify for disability benefits if they have medically documented deficits in verbal communication, non-verbal communication and social interaction and limitations in the ability to understand, recall and apply information, to interact with others, to concentrate and to manage oneself.\n\n3. Nervous System & Sense Organs\na. Parkinson's Disease - If you have been diagnosed with Parkinson's Disease or Parkinsonian syndrome and are no longer able to work, you may quality for disability benefits. Individuals must exhibit extreme limitations in motor function in arms or legs, resulting in limitation in the ability to stand from a seated position, balance while walking or using the arms, or limitations on physical functioning and impacts on understanding or applying information and interacting with others.\nb. Neuralgia—This chronic pain related to trigeminal neuralgia affects part of your face and can be sudden and excruciating. Neuralgia can be difficult to diagnose. A knowledgeable SSD attorney can help you determine whether your diagnosis may qualify for disability benefits.\nc. Blindness—There are special disability rules for people who are blind or have limited vision, recognizing the effect of blindness on an individual's ability to work. You are considered blind under Social Security's definition if your vision cannot be corrected to better than 20/200 in your better eye. If you are blind, you may earn some money and still qualify for disability benefits.\nd. Sciatica—If your sciatic nerve is irritated or compressed, you may suffer severe pain including lower back pain and shooting pain in the legs. Sciatica can limit your ability to handle the physical demands of a job or stay on your feet for any length of time. The question claims examiners will weigh is whether the individual has sought sufficient treatment.\n e. Hearing loss—You may qualify for disability benefits if you are profoundly deaf, but moderate hearing loss does not qualify as disabling hearing loss, according to the SSA.\n",
                      "People with disabilities often are at greater risk for health problems that can be prevented. As a result of having a specific type of disability, such as a spinal cord injury, spina bifida, or multiple sclerosisexternal icon, other physical or mental health conditions can occur. Some of these other health conditions are also called secondary conditions and might include:\n1. Bowel & Bladder \nSome disabilities, such as spinal cord injuries, can affect how well a person's bladder and bowel works.\n2. Fatigue \nFatigue is a feeling of weariness, tiredness, or lack of energy. Fatigue can affect the way a person thinks and feels. It can also interfere with a person's activities of daily living.\n3. Injury \nInjuries—including unintentional injury, homicide, and suicide—are the leading cause of death for people 1 through 44 years of age. The consequences of injuries can include physical, emotional, and financial consequences that can affect the lives of individuals, their families, and society. \n4. Mental Health & Depression \nMental health is how we think, feel, and act as we cope with life. People with disabilities report higher rates of stress and depression than people without disabilities. There are different ways to treat depression. Exercise can be effective for some people. Counseling or medication also might be needed.\n5. Learning Disabilities \nLearning disabilities are disorders that may affect a person's ability to understand or use spoken or written language, do mathematical calculations, coordinate movements, or direct attention. Learning disabilities can be lifelong conditions and some people can have several overlapping learning disabilities. Other people can have a single, isolated learning problem that has little effect on their lives. \n6. Neurological disorders, such as multiple sclerosis, cerebral palsy, Parkinson's disease, and epilepsy.",
                      "The Equality Act 2010 sets out when someone is considered to be disabled and protected from discrimination. The definition is quite wide - so check it even if you don't think you're disabled. For example, you might be covered if you have a learning difficulty, dyslexia or autism. The definition is set out in section 6 of the Equality Act 2010. It says you're disabled if:\na. Physical or mental impairments\nb. That impairment has a substantial and long-term adverse effect on your ability to carry out normal day-to-day activities\n\nSome impairments are automatically treated as a disability. You'll be covered if you have:\na. Cancer, including skin growths that need removing before they become cancerous\nb. a visual impairment - this means you're certified as blind, severely sight impaired, sight impaired or partially sighted\nc. Muiltiple Sclerosis\nd. A severe, long-term disfigurement - for example severe facial scarring or a skin disease\n\nOne has an 'impairment' if their physical or mental abilities are reduced in some way compared to most people. It could be the result of a medical condition - like arthritis in their hands that means they can't grip or carry things as well as other people. An impairment doesn't have to be a diagnosed medical condition. If one is suffering from stress, they might have mental impairments - like difficulty concentrating - as well as physical impairments such as extreme tiredness and difficulty sleeping. It still has to have a substantial and long-term adverse effect on their ability to carry out day-to-day activities. One's impairment doesn't have to stop them doing anything, as long as it makes it harder. It might cause them pain, make things take much longer than they should or mean that they're unable to do an activity more than once.\n\n\n\n"]
      },


      {
        "tag": "special_schools_define",
        "input": ["What is a special school", "What is a special education instituition", "Define a special school", "What is special education", " What do special needs schools mean", "What do you mean by special needs schools", "Define special needs schools", "Define special needs education", "What are special schools", "What are special needs schools", "What does special education mean", "Describe special education", "What is the meaning of special education", "What is the meaning of special schools"],
        "responses": ["A special school is a school catering for students who have special educational needs due to learning difficulties, physical disabilities or behavioral problems. Special schools may be specifically designed, staffed and resourced to provide appropriate special education for children with additional needs.\n\n",
                      "Special education refers to a range of services that can be provided in different ways and in different settings. There's no “one size fits all” approach to special education. It's tailored to meet the needs of students with disabilities. Special education focuses on helping kids with disabilities learn. \n\nBut it doesn't mean placing kids in a special classroom all day long. In fact, federal law says that kids who get special education services should learn in the same classrooms as other kids as much as possible. This is known as the least restrictive environment  (or LRE). The services and supports for one student may be very different from those of another student. It's all about the individual child and giving them the resources they need to make progress in school. \n\nFor example, some students may spend most of the day in a general education classroom. Others may spend just an hour or two in a resource room working with a specialist. And others might need to attend a different school that specializes in teaching kids with learning disabilities. Kids who qualify for special education have an Individualized Education Program (IEP). They get individualized teaching and other resources at no cost to their families. Specialists work with kids on strengths as well as challenges. And families are key members of the team that decides what kids need to thrive in school.",
                      " Special Needs Education is education for students with disabilities, in consideration of their individual educational needs, which aims at full development of their capabilities and at their independence and social participation. Special Needs Education is carried out in various forms, including in resource rooms, in special classes ( both are in regular schools ), and in special schools named “Schools for Special Needs Education”. \n\nFormerly, special schools had been established separately by types of disabilities, as “Schools for the Blind”, “Schools for the Deaf” and “Schools for the Intellectually Disabled, the Physically Disabled and the Health Impaired”. However, the number of children with multiple disabilities is recently increasing, and in order to appropriately meet their needs, the School Education Law was partially amended and enacted in FY 2007. Under the new “Schools for Special Needs Education” system, one particular school can accept several types of disabilities. \n\nSchools for Special Needs Education are schools for children with comparatively severe disabilities. Those schools comprise four levels of departments, namely, kindergarten, elementary, lower secondary and upper secondary departments. (The elementary and the lower secondary are compulsory education.) In Schools for Special Needs Education, children learn by special curriculum, being surrounded by rich number of teachers and various facilities and equipment which meet the needs of those children. Therefore, the expense per student in Schools for Special Needs Education is about 10 times as that in regular schools. \n\nSpecial Needs Education is provided also in regular schools. Special classes are small classes for children with comparatively mild disabilities that may be established in regular elementary and lower secondary schools. It may also be established as a branch class in a hospital for sick children."]
      },

      {
        "tag": "special_schools_ke",
        "input": ["Which special needs schools are in Kenya", "Which special education schools are in Kenya", "Which schools in Kenya are for people with disabilities", "Which special needs instituitions in Kenya would you recommend?", "List special needs schools in Kenya", "Schools for persons with disabilities in Kenya", "Which academic instituitions are in Kenya are recommended for people with disabilities", "Which academic instituitions in Kenya offer special education", "Which schools in Kenya offer special education to people with disabilities", "Schools for the impaired in Kenya", "List Kenyan schools for the disabled", "Show me special needs schools in Kenya", "Show me schools for persons with disabilities in Kenya", "Which schools offer special education in Kenya", "Which academic instituitions offer special needs education in Kenya", "Which schools teach people with disabilities in Kenya", "Which academic instituitions teach people with disabilities in Kenya"],
        "responses": ["A special school is a school catering for students who have special educational needs due to learning difficulties, physical disabilities or behavioral problems. Special schools may be specifically designed, staffed and resourced to provide appropriate special education for children with additional needs. \na. NAIROBI \n1. Treeside Special School for the MH \n2. Kenya Community Centre for Learning\n3. Acorn Sp. Tutorials \n4. Annabel Schools in Donholm \n5. Bidii Primary, Buruburu \n6. The Hermitage Garden, Kabarnet Drive \n7. Treeside, Kasarani \n\nb. MOMBASA \n1. Tudor Cerebral Palsy Foundation \n2. Angels on Earth in Nyali \n Sapling Trust Foundation in Nyali \nTom Mboya school \n\nc. NAKURU\n1. Nakuru Kipepeo School in Milimani\n\nd. KAKAMEGA\n1. Lyan fadhili Hirumbi special unit for MH& Autism",
                      "1. Treeside special school \nSpecialization: Mentally Handicapped\nEmail: info@treesidespecialschool.org\nPhone: +254 722 244642\nLocation: Kasarani, Nairobi\n\n2. Kenya Community Centre for Learning\nSpecialization: All learning disabilities\nEmail: info@kccl.ac.ke\nPhone: +254 721 324894/ +254 734 152809\nLocation: Off Thika Superhighway, Exit 8 Behind Thika Road Mall\n\n\n3. Joyland special school for physically handicapped\nSpecialization: Physically Handicapped\nPhone: 057 2024016\nKilifi Road, Kisumu\n\n\n4. Kambui School for the Deaf\nSpecialization: Deaf\nPhone: 061 20340690\nGithunguri, Kiambu\n\n\n5. Jacaranda Special School\nSpecialization: Autism, cerebral palsy, down syndrome\nPhone:N/A\nLocation: Kilimani, Nairobi\n\n\n6. First steps intervention\nSpecialization: All Learning Disabilities\nEmail: firststepsintervention@gmail.com \nPhone: +254 722 645342\nLocation: Kileleshwa, Nairobi\n\n\n7. Annabel Schools in Donholm\nSpecialization: All Learning Disabilities\nEmail: annabelschools@gmail.com\nPhone: +254 722 308307\nDonholm, Nairobi\n\n\n8. St. Angela's vocational secondary school for the deaf\nSpecialization: Deaf, Blind Deaf\nPhone: +254 056 641006\nLocation: Mumias- Kakamega\n9. Joytown primary school for physically impaired\nSpecialization: Cerebral Palsy, Spina Bifida, Poliomyelitis, Bowlegged & Club foot\nEmail: Joytownss80@gmail.com\nPhone: +254 724 505105\nLocation: Thika, Kenya\n\n\n10. Fairmile School\nSpecialization: Autism\nEmail: fairmileschool@gmail.com\nPhone +254 721 699844\nLocation: Waiyaki Way, Nairobi.",
                      "Are you looking for a special school for a child with either a physical or learning disability? Check out this list of the best special schools in Nairobi and Kenya!\n\n1. St Gerald's Centre for Children with Autism \nSt Gerald's Centre is located in Tigoni, Limuru, in Kiambu County, and is a day and boarding center that offers interventions for children with the Autism Spectrum Disorder. This institution admits children between the ages of 3 and 16, offering multidisciplinary education programs that are tailored to meet each child's individual needs. The founder of St Gerald's, Angela Githieki, believes that dietary intervention is a key component in the management of autism.\nWebsite: https://web.facebook.com/StGeraldsCenterForChildrenWithAutism/?_rdc=1&_rdr \n\n\n2. Kenya Community Centre for Learning(KCCL)\nKCCL is a non-profit making community school located in Nairobi County, behind Thika Road Mall. This institution accepts students with diverse learning challenges aged between 6 and 21 years of age from all cultural, socio-economic and religious backgrounds. KCCL aims to be a model centre for learning and empowerment for persons with special needs by providing an environment that allows for exploration and development of academic and personal potential.\nWebsite: http://www.kccl.ac.ke/ \n\n\n3. Nile Road Special School\nNile Road Special School is another of the best special schools in Nairobi and Kenya. This special school provides treatment for children with physical and mental disorders, with the aim of enabling them to function independently and enjoy a reasonable quality of life. The interventions used at this school include occupational therapy, speech and language therapy, Applied Behavior Analysis (ABA), etc. Nile Road Special School is located on Nile Road off Jogoo Road in Eastlands, Nairobi County. \nWebsite: https://web.facebook.com/vulnerablechildren/ \n\n\n4. PCEA Kambui School for the Deaf\nPCEA Kambui School for the Deaf is a mixed boarding primary school located in Ngewa Location, Githunguri, Kiambu County. This public school was initially started by the Presbyterian Church of East Africa (PCEA) in 1963 to help physically disabled children in the society. Pupils at this school go through the 8-4-4 education system. \nWebsite: http://kambui.deaf.special.primary.school.co.ke/ \n\n\n5. Port Reiz Special School \nThis institution, one of the best special schools in Nairobi and Kenya, was started in 1965 by Miss Margaret Bridgewater. Port Reitz Special School, located in Changamwe, Mombasa County, is a public primary school that integrates a day school for non-challenged children from within the community with a boarding school for physically impaired children. This school follows the 844 primary school curriculum while providing physiotherapy and rehabilitation for those who are physically impaired. \nWebsite: http://portreitzschool.org/ \n\n\n6. Treeside Special School \nTreeside is a mixed boarding school that caters to learners who have learning disabilities and intellectual challenges. This institution moved to its present location at Kasarani in Nairobi County in 1991. Treeside admits learners aged between 7 and 42 years. Intellectually challenged learners who attend this institution benefit from teaching, training and rehabilitation services provided. \nWebsite: http://www.treesidespecialschool.sc.ke/ \n\n\n7. Thika High School for the Blind \nThika High School for the Blind was started by the Salvation Army in 1967 to cater for visually challenged children who had completed primary school. This institution became a public school in 1971, and since then, has aimed to use the most current and appropriate technology to impart knowledge, skills and aptitude to its visually challenged learners. Thika High School for the Blind is a mixed full boarding school located in Thika town, Kiambu County, and draws learners from primary schools for the blind from all over Kenya and neighboring countries. \nWebsite: http://thikahighschoolfortheblind.sc.ke/ \n\n\n8. Jacaranda Special School \nJacaranda Special School is located in Kilimani, Nairobi County, and admits intellectually challenged children from all over the country. This institution is a government-funded facility that was started in 1946. It accepts students with Autism, Down's Syndrome, Cerebral Palsy, etc. \n\n\n9. Joytown Schools for the Physically Impaired \nJoytown Primary and Secondary Schools for the physically challenged were originally started by the Salvation Army, and have since been converted into government schools. The Salvation Army, however, continues to play an active role in the area of spiritual nourishment. Joytown Primary School houses 300 children, while Joytown Secondary has around 200 students. Joytown Secondary School was started to meet the needs of the primary school leavers with physical challenges and has since become an inclusive institution. The Joytown Schools are located in Thika town, Kiambu County. \nWebsite: http://web.salvationarmy.org/kya/www_kya.nsf/vw-sublinks/0A7653ACE6324D8080257553001B6F7D?openDocument \n\n\nKenya Institute of Special Education (KISE)\nKenya Institute of Special Education provides excellent training in special needs education as well as educational materials and assistive devices for persons with disabilities. This institution provides assessments for autism, hearing impairments, visual impairments, learning difficulties, etc. KISE, located at Kasarani in Nairobi County, also has an inclusive preschool where children with special needs are integrated.\n"]
      },

      {
        "tag": "special_schools_purpose",
        "input": ["Why are special schools important", "Why are special needs schools important", "What are the benefits of special education", "What are the advantages of special education?", "What are the benefits of special schools", "What makes special education special", "Why do we need special schools", "Why do we need special education", "Explain the importance of special education", "Explain the importance of special schools", "Why are special schools beneficial", "Why is special education beneficial", "Advantages of special education", "What is the purpose of special education", "Why are special schools necessary", " Are special schools important", "Is special education important"],
        "responses": ["The following are ways that students can benefit from special education tutoring.\n\na. Helps Children Focus On Their Challenges. \nb. Helps Children grow comfortable in seeking assistance. \nc. Easily Match Students With Educators Who Understand Their Disabilities. \nd. Help to identify individual learning styles\n\n\nWhy do we need Special Schools?\nSpecialized learning environment The main objectives of a special needs school are to ensure that children are safe and cared for, that their social and emotional needs are met and supported, and that they have the required supports necessary for them to reach their true academic potential.\n\n\nWhy is special education Special? \nThe purpose of special education is to enable students to grow to their fullest potential by providing a free appropriate public education designed to fit their unique and special needs!",
                      "Special education tutoring is one of the most valuable services that a parent can secure for a child who lives with a learning disability. \n\nChildren with learning disabilities are often overwhelmed by the difficulties they face in a group-learning environment. \n\nMoreover, these children are additionally tasked with the challenge of completing a range of standardized tests. Often, these tests are structured in direct opposition to how they confront and process information.\n\nFollowing are ten ways that students with learning disabilities can benefit from special education tutoring:\n1. Help Children focus on their challenges. \nAttempting to process information and maintain pace with the rest of the class can be challenging. \n\nAs teachers and peers move on to new ideas and skills, students with special needs often find themselves in a state of panic. This is especially true when children learn new lessons that build upon previously presented information. \n\nWhen children have access to special education tutoring, they'll have:\na. Ample opportunity to revisit challenging subject matter\nb. Use new strategies for accurately conceptualizing and comprehending these topics \nc. Prepare to advance into related and more complex materials\n\n2. Help Children grow comfortable in seeking help \nWorking with educators who understand their unique needs helps children feel more comfortable about their learning methods. \n\nFurthermore, special education tutoring helps alter how they approach the learning process. But also these sessions allow students to get a deeper understanding of themselves and how their minds function. \n\nChildren can better ask for help when they need it. They can also be more effective in advocating instructional and test-taking methods to improve their lifelong learning experiences. \n\nFor older teens preparing for higher education, this ability to advocate for themselves will later prove invaluable.\n\n3. Easilymatch students with educators who understand their disabilities. \nIt is not uncommon for special education tutoring services to pair students with educators who live with the same or similar learning disabilities. Furthermore, these tutors often have the best ability to recommend effective strategies\n\n4.Help to identify individual learning styles \nIf an Individualized Education Plan or IEP doesn't yet exist, special education tutoring is most effective when tutors can assist students in identifying their individual learning styles. \nAt Special Education Resource, our tutors all hold degrees in various special education fields of study and specialize in molding the curriculum your child is currently learning to fit their specific learning style.\n\n5. Help to identify the best test taking strategies\nChildren take tests differently when they have learning disorders. \nSadly, in many instances, there is little opportunity to approach the testing process in a way that is optimally suited to the needs of the individual. Special education tutoring services can structure test prep to best meet the needs of those who cannot sit through hour-long sessions of reviews. Moreover, tutors can help students prepare for unexpected questions, such as open-ended questions or having more than one correct answer.",
                      " Special education is of great importance for children with learning disabilities, because it gives them the opportunity to get quality education in line with their unique needs. Special education enables every student to gain a high level of independence and reach their full potential. \n\nIn order to meet specific student needs an Individualized Educational Plan (IEP) is created for each child with learning disabilities. This way, the school designs an educational plan they need to implement based on the identified disability. The IEP is designed by a team comprising teachers, specialists (e.g. special education teachers) and family. The role of parents is crucial in this process, because they know their child best, and can provide a lot of valuable information. \n\nThe goal is to provide the child with the necessary support so that they can advance and get a quality education. Thanks to the IEP program, many special-needs students achieve results on par with the results of regular students. \n\nThe importance of special education lies in the fact that it helps children with special needs to exercise different rights that used to be inaccessible: \n1. Providing an adequate learning environment\n2. Respecting the principle of equality in all segments of education \n3. Positively Impacting mental health"]
      },

      {
        "tag": "special_job_ops",
        "input": ["Which job can a person with a disability have", "What job opportunities are available for people with disabilities", "What kind of occupations can disabled persons get", "What kind of jobs can disabled persons get", "show me job opportunities for people with disabilities in Kenya", "jobs for persons with disabilities", "Which jobs can impaired people get", "Which jobs can persons with impairments get", "Do you have any job opportunities for persons with disabilities", "Job opportunities for persons with impairments", "Job opportunities for persons with disabilities"],
        "responses": ["People with physical disabilities can pursue wide-ranging and growing career opportunities, especially with the increased reliance on remote work. Before the COVID-19 pandemic, only a quarter of the global population worked from home, but that number has increased significantly. Regardless, individuals with disabilities can work in many different roles beyond remote work. Careers in management, education, business, technology, and healthcare all offer opportunities with few physical dexterity, stamina, or mobility requirements. Many of these careers also offer opportunities for people with visual or hearing impairments. People with disabilities have many high-paying career options. In fact, many of the highest-paying careers have little physical requirements. This includes careers in management, business, or information technology, and many of them require only a bachelor's degree. The following list is by no means exhaustive; it is just a place to start your research. People with disabilities can find well-paying careers in many other fields and industries, too.\n\n1. COMPUTER & INFORMATION SYSTEMS MANAGERS \nWhat They Do: These managers oversee companies' computer-related activities.\nWhere They Work: Computer and information systems managers usually work in office settings within manufacturing firms or government agencies. \nEducation or Skills Required for the Role: Most computer and information systems managers possess a bachelor's in computer science or another information technology degree. Many also hold graduate degrees in management information science. \nProjected Job Growth (2019-2029): 10% \n\n\n2. MARKETING MANAGERS \nWhat They Do: Marketing managers plan the strategy for selling products or services effectively. This job requires an analytical mind and the ability to conduct independent research and analysis.\nWhere They Work: Marketing managers usually work in office environments, generally in advertising, public relations, or management settings. \nEducation or Skills Required for the Role: Most marketing managers hold bachelor's degrees in advertising, journalism, or marketing, along with significant work experience in advertising, marketing, and promotion. Some employers prefer candidates with MBAs. \nProjected Job Growth (2019-2029): 7% \n\n\n3. FINANCIAL MANAGERS\nWhat They Do: Financial managers oversee organizations' financial health and create detailed reports to help them reach long-term financial goals. This analytical job requires an independent mind and self-directed work ethic. \nWhere They Work: Financial managers work in offices, usually in financial services and insurance, management of enterprises, or professional services settings. They often collaborate with top executives. \nEducation or Skills Required for the Role: A financial manager typically has a bachelor's degree and significant experience in finance, accounting, and business administration. Some employers may prefer candidates with MBAs. \nProjected Job Growth (2019-2029): 15% \n\n\n4. SALES MANAGERS \nWhat They Do: Sales managers set sales goals for organizations based on their analyses of sales data. \nWhere They Work: Sales managers usually work in an office environment, often in wholesale trade, retail trade, or professional services companies. \nEducation or Skills Required for the Role: Most sales managers hold bachelor's degrees in sales management or business administration, along with extensive experience as sales representatives. Some employers look for applicants with MBAs. \nProjected Job Growth (2019-2029): 4%\n\n\n5. NATURAL SCIENCES MANAGERS \nWhat They Do: Natural sciences managers supervise scientists and researchers. \nWhere They Work: These professionals usually work in offices or laboratories, generally in research, academia, the public sector, or manufacturing. Some natural sciences managers work on field sites. \nEducation or Skills Required for the Role: These professionals typically need a bachelor's with a concentration in natural sciences management. However, some natural sciences managers earn postgraduate degrees to launch their careers. \nProjected Job Growth (2019-2029): 5% \n\n\n6. HUMAN RESOURCE MANAGERS \nWhat They Do: Human resource managers oversee companies' administrative functions. \nWhere They Work: These managers work in offices in nearly every industry.\nEducation or Skills Required for the Role: Human resources managers need a bachelor's in business administration or human resource management. Some employers prefer candidates with MBAs focusing on human resource management. \nProjected Job Growth (2019-2029): 6% \n\n\nCOMPUTER & INFORMATION RESEARCH SCIENTISTS \nWhat They Do: Research scientists work toward discovering new applications for computer and information technology. \nWhere They Work: Computer and information research scientists usually work in the private sector, academia, or computer systems design services. \nEducation or Skills Required for the Role: To work as a computer and information research scientist, you need a master's or higher in computer or information science. An area of specialization, such as artificial intelligence or biomedical technology, also helps. \nProjected Job Growth (2019-2029): 15% \n\n\nINFORMATION SECURITY ANALYSTS \nWhat They Do: Information security analysts protect computer networks from cybersecurity threats such as viruses and hackers. \nWhere They Work: These analysts typically work for computer services companies, financial services organizations, and consulting firms. \nEducation or Skills Required for the Role: Information security analysts usually hold bachelor's degrees in computer science or information technology. Many also possess certificates in cybersecurity. \nProjected Job Growth (2019-2029): 31%",
                      "The National Council for Persons with Disabilities(NCPWD) has a career portal available created to support Persons with Disabilities in their efforts to grow their careers by providing them with opportunities to gain relevant skills and find suitable jobs in industries/roles that they are interested in. As a job seeker you need to register through https://ncpwd.fuzu.com \n\nThe main goal of the portal is to provide equal career development to persons with disabilities, also one of the key innovations of the project is testing the digital and technology-based employment pathway and enhancing employability through digital literacy and soft-skills training using inclusive online platforms both to employers and persons with disabilities. The programme explores innovative market-based interventions to improve livelihoods and autonomy for persons with disabilities who qualify for employment. provides personalized job recommendations, career guidance and learning opportunities for individuals. \n\nLink to portal: https://ncpwd.go.ke/ncpwd-career-portal/ \n\nAVAILABLE JOBS: \n1. Principal Marketing Communication Officer at KENYA ACCREDITATION SERVICE- KENAS \nLocation: Nairobi, Kenya \nCampaign dates: February 22nd, 2022 to March 21st, 2022 \nArea of Work: Sales, marketing, promotion \nNumber of Positions: 1 \nJob Description: The Kenya Accreditation Service is a State Corporation established under the Kenya Accreditation Service Act 2019 mandated to accredit and exercise oversight over conformity assessment providers and maintain an internationally recognized accreditation system. Academic and Professional Qualifications1.At least six (6) years working experience in the public and private sector; three (3) of which must have been a supervisory role;2. Bachelors Degree in Communication, Commerce (Marketing Option), International Business, International Relations, Marketing and any other relevant discipline;3. Management Course lasting not less than four (4) weeks from a recognized institution;4. Demonstrated results in work experience;5. Proficiency in Computer applications;6. Demonstrated results in work performance; and7. Fulfils the requirement of Chapter six (6) of the ConstitutionSkills and Competenciesa) Communicating with impact;b) Managing and supervising people;c) Applying technical expertise and managing projects;d) Planning, organizing, and managing performance;e) Budgeting, analyzing, and innovating;f) Customer and stakeholder orientation;g) Coaching, mentoring, relating, and networking; andh) Technological savviness.Note 1: Only shortlisted candidates will be contacted for interviews. Canvassing will lead to automatic disqualification.Note 2: Successful candidates after interviews will be required to obtain the following documents: Certificate of good conduct from the Directorate of Criminal Investigations (DCI) Tax Compliance Certificate from Kenya Revenue Authority (KRA) Clearance Certificate from Higher Education Loans Board (HELB) Clearance from Ethics and Anti-Corruption Commission (EACC) Clearance Certificate from a Credit Reference Bureau (CRB)KENAS is an equal opportunity employer and respects diversity. Persons living with disabilities, marginalized, and minority groups who meet the job specifications are strongly encouraged to apply. \n\n\n2. General Manager Internal Audit Services at KENYA RAILWAYS CORPORATION \nLocation: Nairobi, Kenya \nCampaign dates: March 14th, 2022 to March 21st, 2022 \nArea of Work: General management, leadership\nNumber of Positions: 1\nJOB DESCRIPTION: Requirements of the Job i. A minimum twelve (12) years' experience in relevant work at least five (5) years of which must be in a senior management position in the Public Service or in reputable organization ii. Bachelor's Degree in any of the following fields: Finance, Accounting, Business Administration, Mathematics, Engineering Statistics, Economics or any other equivalent qualification from a recognized institution. iii. Master's Degree in any of the following fields: Finance, Accounting, Business Administration, Mathematics, Statistics or equivalent qualification from a recognized institution. iv. Certified Public Accountants (K), Certified Internal Auditor (CIA). v. Systems Auditor (CISA), Association of Certified Chartered Accountant. vi) Be in possession of CISA, CIA, Risk Qualification, CFE or any other relevant. vi. Member of Institute of Certified Public Accountant of Kenya (ICPAK) and Institute of Internal Auditors of Kenya (IIA-Kenya). vii. Certificate in Leadership Course lasting not less than four (4) weeks from a recognized institution. viii. Proficiency in Computer applications. ix. Fulfilled the requirements of Chapter Six of the Constitution. \n\n\n3. General Manager Legal Services & Corporation Secretary at KENYA RAILWAYS CORPORATION \nLocation: Nairobi, Kenya \nCampaign dates: March 14th, 2022 to March 21st, 2022 \nArea of Work: Legal \nNumber of Positions: 1 \nJOB DESCRIPTION: General Manager Legal Services & Corporation Secretary - REF: KRBR122 Reports to both the Chief Executive Officer and the Corporation and the Board of Directors Requirements for the job i. Master's degree in a relevant field from a reputable institution ii. Bachelor's degree in Law or equivalent degree from a reputable institution  iii. Postgraduate diploma in Law from the Kenya School of Law or such similar qualification from a reputable institution iv. Working experience of not less than twelve (12) years, five (5) of which must have been in a senior management position in the Corporation or in a comparable position in the Public service or in other reputable organization  v. An advocate of the High Court of Kenya and a member of the Law Society of Kenya  vi. Attended a leadership course lasting not less than four (4) weeks Meets the requirements of Chapter Six of the Constitution of Kenya 2010. \n\n\n4. General Manager Supply Chain Management at KENYA RAILWAYS CORPORATION \nLocation: Nairobi, Kenya \nCampaign dates: March 14th, 2022 to March 21st, 2022 \nArea of Work: General management, leadership \nJOB DESCRIPTION: General Manager Supply Chain Management REF: RBR123 Reporting to the Managing Director for the following: Requirements for the job i) Master's Degree in any of the following:- Business Administration, Economics, Procurement and Supplies Management or other relevant and equivalent qualification from a recognized institution. ii) Bachelor's Degree in any of the following:- Procurement and Supplies Management, Procurement and Logistics, Commerce, Business Administration (Supplies Management Option), or other relevant and equivalent qualifications from a recognized Institution. iii) Twelve (12) years of work experience five (5) of which should be in senior management position iv) Leadership Course lasting not less than four (4) weeks  v) Full membership to a professional body either KISM or CIPS or both. vi) Certified Supplies Practitioner by KISM vii) Meets the provision of chapter six of the Constitution.\n\n\nMORE RECENT OPENINGS AVAILABLE AT NCPWD's portal: https://ncpwd.go.ke/ncpwd-career-portal/ "]
      },

      {
        "tag": "special_interview_tips",
        "input": ["How do you interview someone who is impaired", "How do you interview someone who is disabled", "What interview tips would you give persons with disabilities", "What job interview tips do you have for people with disabilities", "Interview tips for people with disabilities", "How to interview people with disabilities", "How to interview people with impairments", "How can persons with disabilities succeed in interviews", "How can disabled people approach in interviews", "Tips for interviewing people with disabilities", "How to interview a person with a disability", "Tips for interviewing disabled persons", "How to interview students with disabilities", "How to interview disabled students"],
        "responses": ["Interview Tips for Disabled People: \n\n\n1. Investigate the location's accessibility.\nUsing this tip will depend on your particular impairment, but above all, you need to be able to make sure that you can get into the interview room. Do they have any steps that would block a wheelchair? How far is the interview room from the carpark, and do they have disabled parking spaces? Is there an accessible bathroom? Are guide dogs welcome, and is there a hearing loop in the building or interview room? The employer should let you know about all of these things ahead of the day, but if they don't, make sure you ask. Also remember that you should be interviewed under the exact same conditions as an able bodied candidate if an employer wants to conform to equality legislation.\n\n2. Remember to ask good questions. \nQuestions show interest in the position that you're applying for, but they're also a sneaky way for you to show how much you fit the role or to assuage any of the interviewer's concerns. Always include a question that shows you've researched their organisation like 'As your company released a new product line last month, is it planning expansion into a new territory?' Three questions is a good number to aim for. \n\n3. Be prepared to talk about your CV. \nMake sure you print out two copies of your CV - one for you to refer to and one for the interviewer. When you are inevitably asked about items on your CV, having a copy in front of you will stop you forgetting important points. Of course, it goes without saying that everything on there must be truthful. \n4. Confidence is Key. \nInterviews can be nerve wracking, but there are ways to increase your confidence. First of all, know that even if everything goes wrong, wild tigers aren't going to eat you. There will be other interviews. In fact this free e-book is crammed with tips for disabled people to find and getting a new job. Next, be aware that the adrenaline in your system will help you remember things and be on top form. Positive self talk can even trick your mind by saying to yourself “I'm excited, I'm excited” as opposed to “I'm stressed out” before the interview. Listening to powerful music shortly before, writing a letter about a time when you felt powerful, and striking power poses before the interview are all good too. Just don't overdo it and come across as overly confident. \n\n5. Discussing your disability with an employer\nYou're not required to answer anything about your disability that makes you feel uncomfortable, but answering appropriate questions may help a potential employer make reasonable adjustments. If you have a hidden disability and adjustments will be necessary, it's best to bring this up at the interview stage. However during the interview, keep the focus on how great a candidate you are, and all the things you can do. \n\n6. Prepare to answer interview questions\nCompanies have been holding interviews for years making their questions fairly predictable, and you can even buy books on interview questions. Taking an hour or so to work out your responses will help you come across as a polished candidate. It will even help your confidence, but try not to sound rehearsed.\n\n7. Bring a portfolio of work. \nIf it's appropriate to the role you're applying for, bring along a selection of past work along that you're proud of. You can refer to examples from the portfolio in your answers. Even if you're starting out in a line of work, you can create mock pieces to show what you're capable of.\n\n8. Provide a letter of recommendation\nIf you've volunteered with a charity or had a good experience with an employer, see if you can get a letter of recommendation that you can print off and leave with interviewers as you exit the room. It will boost your credibility. Also it will ensure that the interviewer remembers you in a positive light.\n\n\nInterview Tips for Interviewers: \n\n1. Check your own personal biases right up front\nFear and stigma about engaging with job applicants who have disabilities is common. “We see it more in job interviewing than just about anywhere else in the hiring process,” says James Emmett, a disability inclusion expert and Understood's lead workplace strategist.\nAn important part of addressing preconceived notions about disability is recognizing it — not merely among your colleagues, but within yourself. For example, you might think that a person with ADHD will fidget or not stay on topic during your meeting. This is unconscious bias. And it's human nature, especially if you've had limited exposure to people with disabilities. (But you probably have had more exposure than you realize.\n\n\n2. Adjust your expectations. \nWe're conditioned to expect certain things from people we interview: a firm handshake, good eye contact, a ready smile, easy conversation. But people with autism spectrum disorder, for instance, often have trouble with such traditional “people skills.” That may make them less-than-ideal interview candidates by stereotypical standards.\nWhen interviewing, put your personal social preferences on the back burner. Then do your best to evaluate a candidate's behavior based on the needs of the position that's being filled.\n\n3. Set the stage for Success\nOnly a small percentage of job applicants volunteer that they have a disability. And by law, employers can't ask. So how can an interviewer be prepared from a practical standpoint? If your business can't set aside space just for interviews, that's OK. But put some thought into where you might interview job candidates. Is it away from the kitchen and free of odors that could be challenging for people with sensory issues? Can a wheelchair fit comfortably at that conference room table? Book the space as far in advance as possible so there's no last-minute scrambling. When setting up the interview, it's perfectly fine to ask the applicant if there are any accommodations they will need during their visit. If they request something, your earlier thinking about the interview space should make any adjustments relatively easy.\n\n4. Rethink Interview Questions \nHow do you define success? What's your biggest weakness? How do you accept criticism? Abstract interview questions can be a roadblock for many potential — and qualified — hires with disabilities. This is especially true for applicants with autism spectrum disorder who tend to think quite literally.\nHere are some examples of how to ask interview questions in a more inclusive way:\n1. Instead of “Tell me about a problem that occurred on your last job,” ask “In your last job at XYZ company, describe a situation where you had some difficulty.” \n2. Instead of “Tell me your five-year plan,” ask “What are three things you hope to achieve in this job with us?”\n3. Instead of “Tell me about your career experience,” ask “Can you tell me about your jobs at company X and company Y?” \n4. Instead of “Tell me about your biggest weakness,” ask “At your last job at company Y, what was the most difficult part?”\n\n6. Consider alternative interview formats\nNot everyone is comfortable sitting across the desk from an interviewer. And interviewers can't always tell if a candidate is right for a job while sitting in a conference room. So why limit your interview? There are other more inclusive options you can consider:\n1. Invite the applicant on a tour of your workplace.\n2. Consider a 'working' interview (an applicant has the chance to actually demonstrate how they'll do certain tasks.)\n3. Assign a project instead of an interview",
                      "Job Interview Tips for People With Disabilities\n\nFinding work can feel stressful for job seekers with disabilities, who often encounter prejudice during their search. Preparation is the key to convincing employers that a disability doesn't affect performance. This dynamic makes job interviews all the more crucial, because it's often the only chance to make a good impression. Smart applicants face these issues by researching a company beforehand, which helps them to prepare a list of potential questions that they can practice answering.\n\n\n1. Do your Homework\nPreparation is crucial to succeeding in a job interview. To avoid catching potential employers off guard, Nebraska Workforce Development recommends contacting them beforehand about special accommodations or assistance, such as a guide dog. If an interpreter is required, tell the interviewer that he's there to make communication easier and that the interviewer should direct any comments to you. Wear appropriate clothing, but make sure that aids like canes or wheelchairs are clean and in good repair. Always focus on how the accommodations remove potential barriers to doing the job. \n\n\n2. Know your rights. \nKnowing your rights protects you from answering questions that are illegal or discriminatory. The Americans with Disabilities Act of 1990 bars employers from asking questions that might reveal a disability or mental health issue, according to a Volunteer State Health Plan Inc. pamphlet. You don't have to reveal a disability until you need accommodation for it. Employers can ask about these issues only once they make a job offer. Even then, an employer can withdraw offers only for reasons that are job-related or in keeping with business needs. \n\n\n3. Research the Company \nResearch the company thoroughly before the interview. Knowing about the firm's competitors, products or services and salary trends will prepare you for standard questions such as, 'Why do you want to work here?' The Employer Assistance & Resource Network recommends browsing as many resources as possible, such as the company's website, its annual reports, and organizational or trade magazine write-ups. Reading official biographies also offers a good feel for a company's culture and a potential glimmer of insight about your potential interviewer. \n\n\n4.Practice your Responses\nDevelop a list of potential questions, and practice answering them. You can expect at least one behavioral question in which the interviewer asks for an example or story that reveals something about your personality. According to the Employer Assistance & Resource Network, you should recall a problem that you tackled and how the solution shows your suitability for the position. However, don't provide negative information about disabilities or past career failures. Avoid long, chatty answers. Your responses must always direct the conversation to skills and experience that you wish to highlight.\n\n\n\nTips for Interviewing People with Disabilities.\n\n1. Before the Interview. \na. Ask the interviewee if he or she requires any specific accommodation such as wheelchair access, a quiet place in which to be interviewed, an interpreter, etc. If you're unsure about how to provide the accommodation, ask the interviewee.\nb. Allow plenty of time for the interview. Some will require additional time. \n\n\n2. Setting Up the Interview\na. Place yourself and the camera (if applicable) at interviewee's eye level. \nb. If the interview will take place on a platform and the interviewee has a physical disability, be sure there is proper physical access to the interviewing area. \n\n\n3. During the interview. \na. When interviewing a person with disability, speak directly to that person and maintain eye contact rather than interacting directly with an interpreter or companion. \nb. Use the same interviewing techniques and manner that you usually do. Speak in relaxed, everyday tones. \nc. When talking with a person with a hearing loss, be sure to face them and do not cover your mouth when you speak. Place yourself so that you face the light source and are not backlit. Wait to speak until the person is looking at you. \nd. When meeting an interviewee who has a visual impairment, identify yourself and others who are with you. When conversing in a group, remember to identify the person to whom you are speaking. \ne. Listen attentively when you are talking with a person who has difficulty speaking. Be patient and wait for the person to finish speaking rather than correcting them or speaking for them. Never pretend to understand if you are having difficulty doing so. Instead, repeat what you believe was said and allow the person to respond. \nf. When covering an event where a sign or oral interpreter is present, be aware of the communication between an interpreter or real-time captioner and the person using the service. Avoid walking between them or blocking their communication. Often people who use interpreters are located near the front of a room in a designated section. Remember, blocking this communication is like pulling the plug on the public address system."]
      },

      {
        "tag": "special_benefits",
        "input": ["What social benefits do the disabled in Kenya have", "What social benefits do disabled persons in Kenya have", "What are the social benefits people with disabilities get", "Do people with disabilities get social benefits", "Which social services do people with disabilities have access to", "How does the government help disabled persons", "Does the government give financial aid to persons with disabilities?", "Are people with disabilities eligible for financial benefits", "Are people with disabilities eligible for social benefits", "Do disabled people get government benefits in Kenya", "Do disabled people get social benefits in Kenya", "Do disabled people in Kenya get government funding", "Do impaired persons in Kenya get government aid", "Are people with impairments in Kenya eligible for social benefits", "list social benefits for people with disabilities", "list government benefits for people with disabilities", "How do I register for disability benefits"],
        "responses": ["Kenya Government Disability Services\n\nThe Kenyan government has implemented policies, procedures and practices regarding disability services, benefits and grants. One example is The National Safety Net Programme - Cash Transfer for Persons with Severe Disabilities (PWSD-CT). The programme seeks to enhance the capacities of care givers through cash transfers and as such, improve the livelihoods of persons with severe disabilities as well as reduce negative impact of disability on households. It targets adults and children with severe disabilities, who require full time support of a caregiver.\n\nProgramme Objectives\n1. To strengthen the capacities of parents and children with disabilities. \n2.  Improve the livelihoods of parents and children with disabilities. \n3. Alleviate integrated poverty among parents and children with disabilities.\n\nProgramme Coverage\nPersons with Servere Disability Programme(PWSD) is a national programme that covers beneficiaries in all the counties. Currently(2015/16 FY) the programme covers 45,505 households. \n\n3. Amount Paid\nKES 2,000 per household per month delivered every two months through appointed payment agents - currently the Kenya Commercial Bank and Equity Bank. \n\nEligibility\n Households with a person with severe disability and who needs: \n1. Permanent care including feeding, toiletry, protection from danger from themselves and from other persons and the environment and thus, require intensive support on a daily basis.\n2. Must be living within a lower income bracket(poor). \n3. Beneficiary/household must not be enrolled in any other Cash Transfer programme. \n4. A member of the household must not be receiving any pension and/or regular income. \n\n\nNational Council for Persns with Disabilities. \nThe Kenyan government's disability services, benefits, and grants are provided through the National Council for Persons with Disabilities (NCPWD). To take advantage of any of these, individuals must first register with the NCPWD and receive their identification card. To register, a person must go with a passport photo (or 200 shillings) to one of the hospitals listed below. When you get there, a team of medical professionals will fill out a form with you: (Individual_Registration_Form). From there, the NCPWD will be in touch about the status of your application. You can ask your local hospital about free assessment days. On other days, the assessment will cost around 500 shillings. \n\nThe following are the services provided through the NCPWD.\n1. Assistive Devices\nThe National Development Fund for Persons with Disabilities (NDFPWD) supports the provision of Assistive Devices and Services to Persons with Disabilities (PWDs) in Kenya to enable these individuals to function in society.  The Fund gives priority to those individuals requiring assistance to function in a learning, training or work environment. \n2. The Fund provides grants to Community and Self Help Groups for Economic Empowerment or Revolving Fund Schemes. These grants aim to help Persons with Disabilities gain self-sufficiency in generating income and to enable them to gain the skills and experience to access the loans required to grow their business. \n3. Education Assistance\nThis programme aims to improve persons with disabilities enrolment, retention and completion of education cycle for the eventual engagement in decent and gainful employment. NDFPWD provides support to persons with disabilities from Primary, Secondary, Colleges, Vocational Training Schools and University.\n4. Infrastructure & Equipment grants\nInfrastructure and equipment grants aim to enable the maintenance and growth of organizations which provide education or social services for persons with disabilities.\n",
                      "According to socialprotection.go.ke, benefits of registration as a person living with a disability indlude: \n1. Under the Government Procurement Opportunities ((AGPO) one is entitled to 30% of Government's tenders ringfenced for women, youth and persons living with disabilities\n2. Tax exemption for the first Ksh.150,000 monthly income. In addition, a person is allowed to deduct a maximum of Ksh.50,000 in respect of 'home care' and 'personal care' where applicable.\n3. Access to the Kenyan government's cash transfer program. \n4. Tax exemption for assistive devices. \n5. The blind and those on wheel chairs who require personal assistance receive Ksh.15,000 monthly facilitative allowance approved by the Salaries and Remuneration Commission. \n6. Educational assistance from the National Council For Persons Living with Disabilities (NCPWD) based on severity of disability\n7. Free sun screen lotion & lip bals to persons with albinism. \n8. Provision of tools of trade for those who have received vocational training. \n9. Consideration for duty exemption on importation of vehicles modified for use by persons with physical disabilities.\n10. Extension of retirement age to 65 years if one so wishes. \n11. Exemption from payment of parking fees by county governments.",
                      "The Kenyan government has made important progress in establishing specific social protection, economic empowerment and education programmes that directly support persons with disabilities. These include cash transfers, vocational rehabilitation and grants for socioeconomic empowerment. In addition, the Office of the President provides funding to the National Fund for the Disabled of Kenya to facilitate implementation of economic empowerment programmes. \n\n\n1. The National Development Fund for Persons with Disabilities (NDFPWD)\nThe NDFPWD was established under the Persons with Disabilities Act as a permanent fund managed by the National Council for Persons with Disabilities. The NDFPWD draws its funding mainly from annual disbursements from the national government and provides support to persons with disabilities in all counties in Kenya. \n\nThe NDFPWD uses this funding to provide education scholarships, to facilitate economic empowerment through grants that enable persons with disabilities to engage in self-employment, and to provide grants to organisations of persons with disabilities to conduct advocacy. The funds are also used to provide infrastructure and equipment support to learning institutions as well as assistive devices and services to persons with disabilities and albinism. \n\n2. Cash Transfer for Persons with Severe Disabilities (PWSD-CT) \nThe PWSD-CT is one of the three cash transfer programmes implemented under the National Safety Net Programme. The objective of the PWSD-CT is to provide income support to improve the lives of persons with severe disabilities, while strengthening the capacity of caregivers and improving household livelihood opportunities. PWDS-CT operates in all counties in Kenya, with an enrolment of 51,890 households.[15] The PWSD-CT targets households rather than individuals, which may limit the choice and control over the use of the cash transfers by the persons with disabilities themselves.\nTo be eligible for the PWSD-CT, a household must be in extreme poverty; have a person with profound disability who requires permanent care, including feeding, washing and protection from danger; and not be enrolled in any other cash transfer programme.[16] The amount paid to beneficiaries is KES 2,000 per household per month, delivered every two months.\n\n3. National Fund for the Disabled of Kenya (NFDK) \nThe National Fund for the Disabled of Kenya (NFDK)[18] was established as a trusteeship under the Trustees (Perpetual Succession) Act Chapter 164.[19] The NFDK has an overarching goal of promoting the empowerment of persons with disabilities through donations to individuals and institutions. The NFDK draws its funding from annual grants from the national government, rental income and donations. The Office of the President allocates funds to the NFDK through its Management of Cabinet Affairs subprogramme. \n\n4. State Department for Social Protection (SDSP) \nThe State Department for Social Protection (SDSP) implements several social protection and economic empowerment programmes that directly benefit persons with disabilities. These include cash transfers, vocational rehabilitation and grants for socioeconomic empowerment. In addition, the Office of the President provides funding to the National Fund for the Disabled of Kenya to facilitate implementation of economic empowerment programmes."]
      },


      {
        "tag": "assistive_devices",
        "input": ["What are assistive devices", "What is an assistive device", "Define an assistive device", "Define assistive technology", "What do assistive technologies mean?", "List examples of assistive technologies", "Describe assistive devices", "What are assistive devices used for", "Why are assistive devices important", "What do assistive devices mean", "What does an assistive device mean", "What is the meaning of an assistive device", "What is the meaning of assistive devices", "What is the meaning of assistive technology", "List examples of assisive devices", "What do assistive devices do?"],
        "responses": ["Assistive devices are external devices that are designed, made, or adapted to assist a person to perform a particular task. Many people with disabilities depend on assistive devices to enable them to carry out daily activities and participate actively and productively in community life.\nPeople with disabilities have access to appropriate assistive devices that are of good quality and enable them to participate in life at home and work and in the community.\n\n\nCommon Types of Assistive Devices\n\nA. Mobility Devices\nMobility devices may have specialized features to accommodate the needs of the user. For example, a person with cerebral palsy may require a wheelchair with trunk/head supports to ensure he/she is able to maintain a good sitting position. Examples include\n\n1. Wheelchairs \n2. Tricycles \n3. Crutches \n4. Walking Sticks/Canes \n5. Walking Frames/Walkers\n\nB. Positioning Devices \nPeople with physical impairments often have difficulty maintaining good lying, standing or sitting positions for functional activities and are at risk of developing deformities due to improper positioning. The following devices can help overcome some of these difficulties: \n1. Wedges \n2. chairs, e.g. corner chairs, special seats \n3. Standing Frames \n\nC. Prosthetics, orthotics and orthopaedic shoes \nThese are usually custom-made devices which replace, support or correct body parts. They are designed, manufactured and fitted in specialized workshops or centres by trained prosthetic/orthotics personnel and include: \n1. Prosthetics eg artificial legs or hands\n2. orthoses, e.g. spinal braces, hand/leg splints or callipers \n3. Orthopedic shoes\n\nD. Daily living Devices \nThese devices enable people with disabilities to complete the activities of daily living (e.g. eating, bathing, dressing, toileting, home maintenance). There are many examples of these devices, including: \n1. Adapted Cutlery & Cups \n2. Shower seats & stools \n3. Toilet Seats & Frames \n4. Commodes \n5. Dressing Sticks \n\nE. Vision Devices \n\n1. Large Print Books \n2. Magnifiers \n3. Eyeglasses/Spectacles \n4. White Canes \n5. Braille systems for reading and writing \n6. Audio Devices eg. radios, talking books and mobile phones \n7. Screen readers for computers, e.g. JAWS (Job Access with Speech) is a screen reader programme.\n\nF. Hearing Devices\nHearing loss affects a person's ability to communicate and interact with others; it can impact on many areas of development, e.g. speech and language and restricts educational and employment opportunities, resulting in social discrimination and isolation. Devices include: \n1. Hearing Aids \n2. headphones for listening to the television \n3. Amplified Telephones \n4. TTY/TTD (telecommunication devices) \n5. Visual Systems to provide cues eg. a light when the doorbell is ringing\n\nG. Communication Devices \nAugmentative and alternative communication devices can assist individuals who have difficulty understanding and producing speech. They are provided to support speech (augmentative), or to compensate for speech (alternative). Devices include: \n1. communication boards with pictures, symbols or letters of the alphabet \n2. Request Cards \n3. Electronic Speech Input Devices \n4. Computers with specialized equipment and programmes. \n\nH. Cognitive Devices \nCognition is the ability to understand and process information. It refers to the mental functions of the brain such as memory, planning and problem-solving. Brain injuries, intellectual impairment, dementia and mental illness are some of the many conditions that may affect an individual's cognitive ability. The following devices can assist individuals to remember important tasks/events, manage their time and prepare for activities: \n1. Lists \n2. Diaries \n3. Calendars \n4. Schedules \n5. Electronic devices, e.g. mobile phones, pagers, personal organizers.",
                      "Assistive technology enables people to live healthy, productive, independent, and dignified lives, and to participate in education, the labour market and civic life. Assistive technology reduces the need for formal health and support services, long-term care and the work of caregivers. Without assistive technology, people are often excluded, isolated, and locked into poverty, thereby increasing the impact of disease and disability on a person, their family, and society. \n\nWho can benefit from assistive technology? \n1. People with Disabilities \n2. Older People \n3. People with noncommunicable diseases such as diabetes and stroke \n4. People with mental health conditions including dementia and autism. \n5. People with gradual functional decline.\n\nHealth, well-being and socioeconomic benefits \n\nAssistive technology can have a positive impact on the health and well-being of a person and their family, as well as broader socioeconomic benefits. For example: \n1. Proper use of hearing aids by young children leads to improved language skills, without which a person with hearing loss has severely limited opportunities for education and employment. \n2. Manual wheelchairs increase access to education and employment while reducing healthcare costs due to a reduction in the risk of pressure sores and contractures. \n3. Assistive technology can enable older people to continue to live at home and delay or prevent the need for long-term care. \n4. Therapeutic footwear for diabetes reduces the incidence of foot ulcers, preventing lower limb amputations and the associated burden on health systems\n\n\nWhat are some types of assistive devices and how are they used? \n1.Mobility aids, such as wheelchairs, scooters, walkers, canes, crutches1, prosthetic devices, and orthotic devices. \n2. Hearing aids to help people hear or hear more clearly. \n3. Cognitive aids, including computer or electrical assistive devices, to help people with memory, attention, or other challenges in their thinking skills. \n4. Computer software and hardware, such as voice recognition programs, screen readers, and screen enlargement applications, to help people with mobility and sensory impairments use computers and mobile devices. \n5. Tools such as automatic page turners, book holders, and adapted pencil grips to help learners with disabilities participate in educational activities. \n6. Closed captioning to allow people with hearing problems to watch movies, television programs, and other digital media. \n7. Physical modifications in the built environment, including ramps, grab bars, and wider doorways to enable access to buildings, businesses, and workplaces. \n8. Lightweight, high-performance mobility devices that enable persons with disabilities to play sports and be physically active. \n9. Adaptive switches and utensils to allow those with limited motor skills to eat, play games, and accomplish other activities. \n10. Devices and features of devices to help perform tasks such as cooking, dressing, and grooming; specialized handles and grips, devices that extend reach, and lights on telephones and doorbells are a few examples.",
                      "Assistive technology is technology used by individuals with disabilities in order to perform functions that might otherwise be difficult or impossible.\n\n\nTypes of Assistive Technologies \n1. Vision \nProducts for people who are blind or visually impaired, including AT used for daily living activities, accessing computers, wayfinding, and other needs. Examples include: \n1. Magnifiers \n2. Talking Devices. \n3. Braille Displays \n4. Screen Reading Software \n5. Text to Speech systems using Optical Character Recognition(OCR) \n6. Large Print Materials \n7. Phones with large tactile buttons. \n\n\n2. Hearing \nProducts for people who are Deaf or hard of hearing, including AT used daily living activities, communication, and other needs. Examples include: \n1. Personal amplification systems. \n2. Wireless TV listening Systems \n3. Vibrating  alarm clocks \n4. Doorbell with flashing light alert \n5. Portable Closed captioning system \n6. face-to-face dual keyboard communication system \n7. Amplified Telephones \n8. Phone with Captioning \n9. Mobile Devices with texting or specialised apps \n\n\n3. Speech Communication\nProducts for people with speech disabilities who need assistance with speaking including face-to-face communication.  Examples include: \n1. Voice Amplification Systems \n2. Fluency Assistive Devices \n3. Artificial Larynx \n4. Communication Boards \n5. Speech Output Software \n6. Symbol Making Software \n7. Speech generating devices \n\n\n4. Learning, Cognition & Developmental \nProducts for people who need assistance with learning, attention, memory, and organization. Examples include: \n1. Memory Aids \n2. Text to speech system to support learning \n3. Reminder Systems \n4. Notetaking Systems \n4. Mobile Devices with specialised apps \n5. Audio Books \n\n\n5. Mobility, seating, and positioning \nProducts for people who need mobility assistance. Examples include: \n1. Wheelchairs \n2. Walkers \n3. Canes \n4. Crutches \n5. Scooters \n6. Power chairs as well as products designed to provide postural and pressure management.\n\n\n6. Daily Living \nProducts for people with disabilities and older adults with functional limitations due to aging. These products increase independence when performing activities of daily living such as bathing, dressing, personal hygiene, eating and other basic home/life activities including shopping and money management. Examples include: \n1. Dressing aids such as zipper pulls and button hooks. \n2. Long handle shoe horn \n3. Reacher \n4. Adapted Kitchen tools &b eating utensils \n5. Walker Carrying bag \n6. Wheelchair cup holder \n7. Book Stand \n8. Automated Soap Dispenser \n9. Vaccum Robot \n\n\n7. Environmental Adaptations \nProducts designed to increase access to homes, businesses, and other buildings by people with disabilities and include systems to open/lock doors, control lighting, temperature and other environmental needs. Examples include: \n1. Door Openers \n2. Lifts \n3. Ramps \n4. Systems designed to remotely control appliances \n5. Electronics \n6. Other products using a switch, voice or other method of activation. "]
      },

      {
        "tag" : "joke",
        "input": ["Can you tell me a joke", "Tell me a joke", "Got a joke for me", "Tell me something funny", "How about a joke", "Are you funny", "Be funny Kemba", "Be a funny guy", "Humor me", "Humour me", "Got a sense of humor", "Got a sense of humour", "Do you have a sense of humor", "Do you have a sense of humour",  "Humour me", "Id like a joke please", "Tell us a joke", "Make me laugh", "I would like to laugh", "Got a joke for me"],
        "responses":["Well, Why did the frog take the bus to work today?\nBecause, his car got TOAD!",
                    "How do BillBoards Talk?\nSign Language!",
                    "Whats the best Kung Fu Vegetable,\nBrocc Lee",
                    "When is the best day to cook,\nFry Day"]
      },

      {
        "tag" : "contacts_pwd_groups",
        "input":["Can I get contact information for disability support groups or organisations", "Have any contact information for disability organisations?", "How can I contact disability organisations", "Do you have contacts for pwd organisations", "Contact information for disability groups", "Do you have phone numbers of diability organisations in Kenya", "Do you have email addresses of disability organisations in Kenya", "How can I contact disability organisations in Kenya", "How can I reach out to disability groups in Kenya", "Contact Info for Kenyan Disability Organisations", "Give me Contact Information for Kenyan Disability Organisations", "Have any contact information for disability organisations in Kenya?", " How to reach out to disability groups in Kenya \n\nAPDK Nairobi Branch:\nWaiyaki Way, Opp. ABC Place/Oilibya Petrol Station\n(At the Kabete Orthopedic Compound)\nP.O. Box 46747- 00100, Nairobi \nCellphone: + 254 722 334677 / 734 590497  \nWireless:  +254 (020) 232472 \nEmail Address:info@apdk.org\n\n\n"],
        "responses":["There are numerous government sponsored, private & even community based organisations for persons with disabilities in Kenya.Here is a list of a few of these organisations/groups \nContact Information\n\nThe National Council for Persons with Disabilities \nAddress: Box 66577-00800, Nairobi \nTelephone: 020 2375994/ 020 2314621/ 0709 107 000 \nToll Free: 0800 724 333 \nEmail Address: info@ncpwd.go.ke\n\n\nKenya Association for the Intellectually Handicapped\nPhysical Office Address - Room A11 Ground floor Mutindwa Flats- Umoja Off Moi-Drive \nE-mail : info@kaihid.org Cell Phone: \n+254722926918, +254207789948\n\n\nUsers and Survivors of Psychiatry Kenya\n\n\nUsers and Survivors of Psychiatry Kenya\n5th Floor Queensway House, Kaunda Street, NAIROBI \n0791952925 OR 0720469614 \nEmail: info@uspkenya.org\n\n\nWomen Challenged to Challenge\nPhysical Address: Orthopedic Workshop, Waiyaki Way \n(Opposite ABC Place) \nP.O Box 10593-00100 \nNAIROBI \nMobile No: 0725868450 \nEmail:womenchallenged@gmail.com \nthechallengedwcc@yahoo.com"]
      }
    ]
  }